pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*******************************************************************************
 * GPIO_PDIR - Port Data Input Register
 ******************************************************************************/

/*!
 * @brief GPIO_PDIR - Port Data Input Register (RO)
 *
 * Reset value: 0x00U
 *
 * Do not modify pin configuration registers associated with pins not available
 * in your selected package. All un-bonded pins not available in your package
 * will default to DISABLE state for lowest power consumption.
 */
/*!
 * @name Constants and macros for entire GPIO_PDIR register
 */
/*@{*/
#define GPIO_RD_PDIR(base)       (GPIO_PDIR_REG(base))
/*@}*/

/*******************************************************************************
 * GPIO_PDDR - Port Data Direction Register
 ******************************************************************************/

/*!
 * @brief GPIO_PDDR - Port Data Direction Register (RW)
 *
 * Reset value: 0x00U
 *
 * The PDDR configures the individual port pins for input or output.
 */
/*!
 * @name Constants and macros for entire GPIO_PDDR register
 */
/*@{*/
#define GPIO_RD_PDDR(base)       (GPIO_PDDR_REG(base))
#define GPIO_WR_PDDR(base, value) (GPIO_PDDR_REG(base) = (value))
#define GPIO_RMW_PDDR(base, mask, value) (GPIO_WR_PDDR(base, (GPIO_RD_PDDR(base) & ~(mask)) | (value)))
#define GPIO_SET_PDDR(base, value) (BME_OR8(&GPIO_PDDR_REG(base), (uint8_t)(value)))
#define GPIO_CLR_PDDR(base, value) (BME_AND8(&GPIO_PDDR_REG(base), (uint8_t)(~(value))))
#define GPIO_TOG_PDDR(base, value) (BME_XOR8(&GPIO_PDDR_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * GPIO_GACR - GPIO Attribute Checker Register
 ******************************************************************************/

/*!
 * @brief GPIO_GACR - GPIO Attribute Checker Register (RW)
 *
 * Reset value: 0x00U
 *
 * The GPIO module supports a device-specific number of data ports GPIO supports
 * single-cycle accesses from the processor core IOPORT bus as well as
 * references from the PBRIDGE-mapped address space. Since the core's IOPORT does not
 * support any type of bus stalls or error terminations, if an IOPORT access fails
 * the attribute checks, it is treated as a RAZ/WI access, that is, reads-as-zero
 * and writes ignored. GPIO GACRn register is checked for PBRDIGE accesses only if
 * the corresponding PACRn register allowed the reference. The appropriate PACRn
 * controls access rights to the entire GPIO address space, while the GACRn
 * registers define the access rights down to the byte level for the actual data
 * ports.
 */
/*!
 * @name Constants and macros for entire GPIO_GACR register
 */
/*@{*/
#define GPIO_RD_GACR(base)       (GPIO_GACR_REG(base))
#define GPIO_WR_GACR(base, value) (GPIO_GACR_REG(base) = (value))
#define GPIO_RMW_GACR(base, mask, value) (GPIO_WR_GACR(base, (GPIO_RD_GACR(base) & ~(mask)) | (value)))
#define GPIO_SET_GACR(base, value) (BME_OR8(&GPIO_GACR_REG(base), (uint8_t)(value)))
#define GPIO_CLR_GACR(base, value) (BME_AND8(&GPIO_GACR_REG(base), (uint8_t)(~(value))))
#define GPIO_TOG_GACR(base, value) (BME_XOR8(&GPIO_GACR_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual GPIO_GACR bitfields
 */

/*!
 * @name Register GPIO_GACR, field ACB[2:0] (RW)
 *
 * This 3 bit field defines the attributes required to access the corresponding
 * GPIO port's programming model.
 *
 * Values:
 * - 000 - User nonsecure: Read + Write; User Secure: Read + Write; Privileged
 *     Secure: Read + Write
 * - 001 - User nonsecure: Read; User Secure: Read + Write; Privileged Secure:
 *     Read + Write
 * - 010 - User nonsecure: None; User Secure: Read + Write; Privileged Secure:
 *     Read + Write
 * - 011 - User nonsecure: Read; User Secure: Read; Privileged Secure: Read +
 *     Write
 * - 100 - User nonsecure: None; User Secure: Read; Privileged Secure: Read +
 *     Write
 * - 101 - User nonsecure: None; User Secure: None; Privileged Secure: Read +
 *     Write
 * - 110 - User nonsecure: None; User Secure: None; Privileged Secure: Read
 * - 111 - User nonsecure: None; User Secure: None; Privileged Secure: None
 */
/*@{*/
/*! @brief Read current value of the GPIO_GACR_ACB field. */
#define GPIO_RD_GACR_ACB(base) ((GPIO_GACR_REG(base) & GPIO_GACR_ACB_MASK) >> GPIO_GACR_ACB_SHIFT)
#define GPIO_BRD_GACR_ACB(base) (BME_UBFX8(&GPIO_GACR_REG(base), GPIO_GACR_ACB_SHIFT, GPIO_GACR_ACB_WIDTH))

/*! @brief Set the ACB field to a new value. */
#define GPIO_WR_GACR_ACB(base, value) (GPIO_RMW_GACR(base, GPIO_GACR_ACB_MASK, GPIO_GACR_ACB(value)))
#define GPIO_BWR_GACR_ACB(base, value) (BME_BFI8(&GPIO_GACR_REG(base), ((uint8_t)(value) << GPIO_GACR_ACB_SHIFT), GPIO_GACR_ACB_SHIFT, GPIO_GACR_ACB_WIDTH))
/*@}*/

/*!
 * @name Register GPIO_GACR, field ROB[7] (RW)
 *
 * This register bit provides a mechanism to "lock" the configuration state
 * defined by ACB. Once asserted, this bit remains set and attempted writes to the
 * ACB are ignored until the next system reset clears the flag.
 *
 * Values:
 * - 0 - Writes to the ACB are allowed.
 * - 1 - Writes to the ACB are ignored.
 */
/*@{*/
/*! @brief Read current value of the GPIO_GACR_ROB field. */
#define GPIO_RD_GACR_ROB(base) ((GPIO_GACR_REG(base) & GPIO_GACR_ROB_MASK) >> GPIO_GACR_ROB_SHIFT)
#define GPIO_BRD_GACR_ROB(base) (BME_UBFX8(&GPIO_GACR_REG(base), GPIO_GACR_ROB_SHIFT, GPIO_GACR_ROB_WIDTH))

/*! @brief Set the ROB field to a new value. */
#define GPIO_WR_GACR_ROB(base, value) (GPIO_RMW_GACR(base, GPIO_GACR_ROB_MASK, GPIO_GACR_ROB(value)))
#define GPIO_BWR_GACR_ROB(base, value) (BME_BFI8(&GPIO_GACR_REG(base), ((uint8_t)(value) << GPIO_GACR_ROB_SHIFT), GPIO_GACR_ROB_SHIFT, GPIO_GACR_ROB_WIDTH))
/*@}*/

/*
 * MKM34ZA5 I2C
 *
 * Inter-Integrated Circuit
 *
 * Registers defined in this header file:
 * - I2C_A1 - I2C Address Register 1
 * - I2C_F - I2C Frequency Divider register
 * - I2C_C1 - I2C Control Register 1
 * - I2C_S - I2C Status register
 * - I2C_D - I2C Data I/O register
 * - I2C_C2 - I2C Control Register 2
 * - I2C_FLT - I2C Programmable Input Glitch Filter Register
 * - I2C_RA - I2C Range Address register
 * - I2C_SMB - I2C SMBus Control and Status register
 * - I2C_A2 - I2C Address Register 2
 * - I2C_SLTH - I2C SCL Low Timeout Register High
 * - I2C_SLTL - I2C SCL Low Timeout Register Low
 */

#define I2C_INSTANCE_COUNT (2U) /*!< Number of instances of the I2C module. */
#define I2C0_IDX (0U) /*!< Instance number for I2C0. */
#define I2C1_IDX (1U) /*!< Instance number for I2C1. */

