pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*! @brief Set the BPDLCD60 field to a new value. */
#define LCD_WR_WF8B_BPDLCD60(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD60_MASK, LCD_WF8B_BPDLCD60(value)))
#define LCD_BWR_WF8B_BPDLCD60(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD60_SHIFT), LCD_WF8B_BPDLCD60_SHIFT, LCD_WF8B_BPDLCD60_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD10[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD10 field. */
#define LCD_RD_WF8B_BPDLCD10(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD10_MASK) >> LCD_WF8B_BPDLCD10_SHIFT)
#define LCD_BRD_WF8B_BPDLCD10(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD10_SHIFT, LCD_WF8B_BPDLCD10_WIDTH))

/*! @brief Set the BPDLCD10 field to a new value. */
#define LCD_WR_WF8B_BPDLCD10(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD10_MASK, LCD_WF8B_BPDLCD10(value)))
#define LCD_BWR_WF8B_BPDLCD10(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD10_SHIFT), LCD_WF8B_BPDLCD10_SHIFT, LCD_WF8B_BPDLCD10_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD21[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD21 field. */
#define LCD_RD_WF8B_BPDLCD21(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD21_MASK) >> LCD_WF8B_BPDLCD21_SHIFT)
#define LCD_BRD_WF8B_BPDLCD21(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD21_SHIFT, LCD_WF8B_BPDLCD21_WIDTH))

/*! @brief Set the BPDLCD21 field to a new value. */
#define LCD_WR_WF8B_BPDLCD21(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD21_MASK, LCD_WF8B_BPDLCD21(value)))
#define LCD_BWR_WF8B_BPDLCD21(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD21_SHIFT), LCD_WF8B_BPDLCD21_SHIFT, LCD_WF8B_BPDLCD21_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD49[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD49 field. */
#define LCD_RD_WF8B_BPDLCD49(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD49_MASK) >> LCD_WF8B_BPDLCD49_SHIFT)
#define LCD_BRD_WF8B_BPDLCD49(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD49_SHIFT, LCD_WF8B_BPDLCD49_WIDTH))

/*! @brief Set the BPDLCD49 field to a new value. */
#define LCD_WR_WF8B_BPDLCD49(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD49_MASK, LCD_WF8B_BPDLCD49(value)))
#define LCD_BWR_WF8B_BPDLCD49(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD49_SHIFT), LCD_WF8B_BPDLCD49_SHIFT, LCD_WF8B_BPDLCD49_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD1[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD1 field. */
#define LCD_RD_WF8B_BPDLCD1(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD1_MASK) >> LCD_WF8B_BPDLCD1_SHIFT)
#define LCD_BRD_WF8B_BPDLCD1(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD1_SHIFT, LCD_WF8B_BPDLCD1_WIDTH))

/*! @brief Set the BPDLCD1 field to a new value. */
#define LCD_WR_WF8B_BPDLCD1(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD1_MASK, LCD_WF8B_BPDLCD1(value)))
#define LCD_BWR_WF8B_BPDLCD1(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD1_SHIFT), LCD_WF8B_BPDLCD1_SHIFT, LCD_WF8B_BPDLCD1_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD25[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD25 field. */
#define LCD_RD_WF8B_BPDLCD25(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD25_MASK) >> LCD_WF8B_BPDLCD25_SHIFT)
#define LCD_BRD_WF8B_BPDLCD25(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD25_SHIFT, LCD_WF8B_BPDLCD25_WIDTH))

/*! @brief Set the BPDLCD25 field to a new value. */
#define LCD_WR_WF8B_BPDLCD25(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD25_MASK, LCD_WF8B_BPDLCD25(value)))
#define LCD_BWR_WF8B_BPDLCD25(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD25_SHIFT), LCD_WF8B_BPDLCD25_SHIFT, LCD_WF8B_BPDLCD25_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD20[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD20 field. */
#define LCD_RD_WF8B_BPDLCD20(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD20_MASK) >> LCD_WF8B_BPDLCD20_SHIFT)
#define LCD_BRD_WF8B_BPDLCD20(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD20_SHIFT, LCD_WF8B_BPDLCD20_WIDTH))

/*! @brief Set the BPDLCD20 field to a new value. */
#define LCD_WR_WF8B_BPDLCD20(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD20_MASK, LCD_WF8B_BPDLCD20(value)))
#define LCD_BWR_WF8B_BPDLCD20(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD20_SHIFT), LCD_WF8B_BPDLCD20_SHIFT, LCD_WF8B_BPDLCD20_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD2[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD2 field. */
#define LCD_RD_WF8B_BPDLCD2(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD2_MASK) >> LCD_WF8B_BPDLCD2_SHIFT)
#define LCD_BRD_WF8B_BPDLCD2(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD2_SHIFT, LCD_WF8B_BPDLCD2_WIDTH))

/*! @brief Set the BPDLCD2 field to a new value. */
#define LCD_WR_WF8B_BPDLCD2(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD2_MASK, LCD_WF8B_BPDLCD2(value)))
#define LCD_BWR_WF8B_BPDLCD2(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD2_SHIFT), LCD_WF8B_BPDLCD2_SHIFT, LCD_WF8B_BPDLCD2_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD55[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD55 field. */
#define LCD_RD_WF8B_BPDLCD55(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD55_MASK) >> LCD_WF8B_BPDLCD55_SHIFT)
#define LCD_BRD_WF8B_BPDLCD55(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD55_SHIFT, LCD_WF8B_BPDLCD55_WIDTH))

/*! @brief Set the BPDLCD55 field to a new value. */
#define LCD_WR_WF8B_BPDLCD55(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD55_MASK, LCD_WF8B_BPDLCD55(value)))
#define LCD_BWR_WF8B_BPDLCD55(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD55_SHIFT), LCD_WF8B_BPDLCD55_SHIFT, LCD_WF8B_BPDLCD55_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD59[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD59 field. */
#define LCD_RD_WF8B_BPDLCD59(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD59_MASK) >> LCD_WF8B_BPDLCD59_SHIFT)
#define LCD_BRD_WF8B_BPDLCD59(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD59_SHIFT, LCD_WF8B_BPDLCD59_WIDTH))

