pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*! @brief Set the BPFLCD3 field to a new value. */
#define LCD_WR_WF8B_BPFLCD3(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD3_MASK, LCD_WF8B_BPFLCD3(value)))
#define LCD_BWR_WF8B_BPFLCD3(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD3_SHIFT), LCD_WF8B_BPFLCD3_SHIFT, LCD_WF8B_BPFLCD3_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD37[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD37 field. */
#define LCD_RD_WF8B_BPFLCD37(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD37_MASK) >> LCD_WF8B_BPFLCD37_SHIFT)
#define LCD_BRD_WF8B_BPFLCD37(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD37_SHIFT, LCD_WF8B_BPFLCD37_WIDTH))

/*! @brief Set the BPFLCD37 field to a new value. */
#define LCD_WR_WF8B_BPFLCD37(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD37_MASK, LCD_WF8B_BPFLCD37(value)))
#define LCD_BWR_WF8B_BPFLCD37(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD37_SHIFT), LCD_WF8B_BPFLCD37_SHIFT, LCD_WF8B_BPFLCD37_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD49[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD49 field. */
#define LCD_RD_WF8B_BPFLCD49(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD49_MASK) >> LCD_WF8B_BPFLCD49_SHIFT)
#define LCD_BRD_WF8B_BPFLCD49(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD49_SHIFT, LCD_WF8B_BPFLCD49_WIDTH))

/*! @brief Set the BPFLCD49 field to a new value. */
#define LCD_WR_WF8B_BPFLCD49(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD49_MASK, LCD_WF8B_BPFLCD49(value)))
#define LCD_BWR_WF8B_BPFLCD49(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD49_SHIFT), LCD_WF8B_BPFLCD49_SHIFT, LCD_WF8B_BPFLCD49_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD20[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD20 field. */
#define LCD_RD_WF8B_BPFLCD20(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD20_MASK) >> LCD_WF8B_BPFLCD20_SHIFT)
#define LCD_BRD_WF8B_BPFLCD20(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD20_SHIFT, LCD_WF8B_BPFLCD20_WIDTH))

/*! @brief Set the BPFLCD20 field to a new value. */
#define LCD_WR_WF8B_BPFLCD20(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD20_MASK, LCD_WF8B_BPFLCD20(value)))
#define LCD_BWR_WF8B_BPFLCD20(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD20_SHIFT), LCD_WF8B_BPFLCD20_SHIFT, LCD_WF8B_BPFLCD20_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD44[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD44 field. */
#define LCD_RD_WF8B_BPFLCD44(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD44_MASK) >> LCD_WF8B_BPFLCD44_SHIFT)
#define LCD_BRD_WF8B_BPFLCD44(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD44_SHIFT, LCD_WF8B_BPFLCD44_WIDTH))

/*! @brief Set the BPFLCD44 field to a new value. */
#define LCD_WR_WF8B_BPFLCD44(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD44_MASK, LCD_WF8B_BPFLCD44(value)))
#define LCD_BWR_WF8B_BPFLCD44(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD44_SHIFT), LCD_WF8B_BPFLCD44_SHIFT, LCD_WF8B_BPFLCD44_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD30[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD30 field. */
#define LCD_RD_WF8B_BPFLCD30(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD30_MASK) >> LCD_WF8B_BPFLCD30_SHIFT)
#define LCD_BRD_WF8B_BPFLCD30(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD30_SHIFT, LCD_WF8B_BPFLCD30_WIDTH))

/*! @brief Set the BPFLCD30 field to a new value. */
#define LCD_WR_WF8B_BPFLCD30(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD30_MASK, LCD_WF8B_BPFLCD30(value)))
#define LCD_BWR_WF8B_BPFLCD30(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD30_SHIFT), LCD_WF8B_BPFLCD30_SHIFT, LCD_WF8B_BPFLCD30_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD21[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD21 field. */
#define LCD_RD_WF8B_BPFLCD21(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD21_MASK) >> LCD_WF8B_BPFLCD21_SHIFT)
#define LCD_BRD_WF8B_BPFLCD21(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD21_SHIFT, LCD_WF8B_BPFLCD21_WIDTH))

/*! @brief Set the BPFLCD21 field to a new value. */
#define LCD_WR_WF8B_BPFLCD21(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD21_MASK, LCD_WF8B_BPFLCD21(value)))
#define LCD_BWR_WF8B_BPFLCD21(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD21_SHIFT), LCD_WF8B_BPFLCD21_SHIFT, LCD_WF8B_BPFLCD21_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD35[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD35 field. */
#define LCD_RD_WF8B_BPFLCD35(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD35_MASK) >> LCD_WF8B_BPFLCD35_SHIFT)
#define LCD_BRD_WF8B_BPFLCD35(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD35_SHIFT, LCD_WF8B_BPFLCD35_WIDTH))

/*! @brief Set the BPFLCD35 field to a new value. */
#define LCD_WR_WF8B_BPFLCD35(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD35_MASK, LCD_WF8B_BPFLCD35(value)))
#define LCD_BWR_WF8B_BPFLCD35(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD35_SHIFT), LCD_WF8B_BPFLCD35_SHIFT, LCD_WF8B_BPFLCD35_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD4[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD4 field. */
#define LCD_RD_WF8B_BPFLCD4(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD4_MASK) >> LCD_WF8B_BPFLCD4_SHIFT)
#define LCD_BRD_WF8B_BPFLCD4(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD4_SHIFT, LCD_WF8B_BPFLCD4_WIDTH))

/*! @brief Set the BPFLCD4 field to a new value. */
#define LCD_WR_WF8B_BPFLCD4(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD4_MASK, LCD_WF8B_BPFLCD4(value)))
#define LCD_BWR_WF8B_BPFLCD4(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD4_SHIFT), LCD_WF8B_BPFLCD4_SHIFT, LCD_WF8B_BPFLCD4_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD31[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD31 field. */
#define LCD_RD_WF8B_BPFLCD31(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD31_MASK) >> LCD_WF8B_BPFLCD31_SHIFT)
#define LCD_BRD_WF8B_BPFLCD31(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD31_SHIFT, LCD_WF8B_BPFLCD31_WIDTH))

/*! @brief Set the BPFLCD31 field to a new value. */
#define LCD_WR_WF8B_BPFLCD31(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD31_MASK, LCD_WF8B_BPFLCD31(value)))
#define LCD_BWR_WF8B_BPFLCD31(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD31_SHIFT), LCD_WF8B_BPFLCD31_SHIFT, LCD_WF8B_BPFLCD31_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD48[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD48 field. */
#define LCD_RD_WF8B_BPFLCD48(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD48_MASK) >> LCD_WF8B_BPFLCD48_SHIFT)
#define LCD_BRD_WF8B_BPFLCD48(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD48_SHIFT, LCD_WF8B_BPFLCD48_WIDTH))

