pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*! @brief Set the M6WE field to a new value. */
#define MPU_WR_WORD_M6WE(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M6WE_MASK, MPU_WORD_M6WE(value)))
#define MPU_BWR_WORD_M6WE(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M6WE_SHIFT), MPU_WORD_M6WE_SHIFT, MPU_WORD_M6WE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M6RE[29] (RW)
 *
 * Values:
 * - 0 - Bus master 6 reads terminate with an access error and the read is not
 *     performed
 * - 1 - Bus master 6 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M6RE field. */
#define MPU_RD_WORD_M6RE(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M6RE_MASK) >> MPU_WORD_M6RE_SHIFT)
#define MPU_BRD_WORD_M6RE(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M6RE_SHIFT, MPU_WORD_M6RE_WIDTH))

/*! @brief Set the M6RE field to a new value. */
#define MPU_WR_WORD_M6RE(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M6RE_MASK, MPU_WORD_M6RE(value)))
#define MPU_BWR_WORD_M6RE(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M6RE_SHIFT), MPU_WORD_M6RE_SHIFT, MPU_WORD_M6RE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M7WE[30] (RW)
 *
 * Values:
 * - 0 - Bus master 7 writes terminate with an access error and the write is not
 *     performed
 * - 1 - Bus master 7 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M7WE field. */
#define MPU_RD_WORD_M7WE(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M7WE_MASK) >> MPU_WORD_M7WE_SHIFT)
#define MPU_BRD_WORD_M7WE(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M7WE_SHIFT, MPU_WORD_M7WE_WIDTH))

/*! @brief Set the M7WE field to a new value. */
#define MPU_WR_WORD_M7WE(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M7WE_MASK, MPU_WORD_M7WE(value)))
#define MPU_BWR_WORD_M7WE(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M7WE_SHIFT), MPU_WORD_M7WE_SHIFT, MPU_WORD_M7WE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M7RE[31] (RW)
 *
 * Values:
 * - 0 - Bus master 7 reads terminate with an access error and the read is not
 *     performed
 * - 1 - Bus master 7 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M7RE field. */
#define MPU_RD_WORD_M7RE(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M7RE_MASK) >> MPU_WORD_M7RE_SHIFT)
#define MPU_BRD_WORD_M7RE(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M7RE_SHIFT, MPU_WORD_M7RE_WIDTH))

/*! @brief Set the M7RE field to a new value. */
#define MPU_WR_WORD_M7RE(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M7RE_MASK, MPU_WORD_M7RE(value)))
#define MPU_BWR_WORD_M7RE(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M7RE_SHIFT), MPU_WORD_M7RE_SHIFT, MPU_WORD_M7RE_WIDTH))
/*@}*/

/*******************************************************************************
 * MPU_RGDAAC - Region Descriptor Alternate Access Control n
 ******************************************************************************/

/*!
 * @brief MPU_RGDAAC - Region Descriptor Alternate Access Control n (RW)
 *
 * Reset value: 0x0061F7DFU
 *
 * Because software may adjust only the access controls within a region
 * descriptor (RGDn_WORD2) as different tasks execute, an alternate programming view of
 * this 32-bit entity is available. Writing to this register does not affect the
 * descriptor's valid bit.
 */
/*!
 * @name Constants and macros for entire MPU_RGDAAC register
 */
/*@{*/
#define MPU_RD_RGDAAC(base, index) (MPU_RGDAAC_REG(base, index))
#define MPU_WR_RGDAAC(base, index, value) (MPU_RGDAAC_REG(base, index) = (value))
#define MPU_RMW_RGDAAC(base, index, mask, value) (MPU_WR_RGDAAC(base, index, (MPU_RD_RGDAAC(base, index) & ~(mask)) | (value)))
#define MPU_SET_RGDAAC(base, index, value) (BME_OR32(&MPU_RGDAAC_REG(base, index), (uint32_t)(value)))
#define MPU_CLR_RGDAAC(base, index, value) (BME_AND32(&MPU_RGDAAC_REG(base, index), (uint32_t)(~(value))))
#define MPU_TOG_RGDAAC(base, index, value) (BME_XOR32(&MPU_RGDAAC_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual MPU_RGDAAC bitfields
 */

/*!
 * @name Register MPU_RGDAAC, field M0UM[2:0] (RW)
 *
 * See M3UM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M0UM field. */
#define MPU_RD_RGDAAC_M0UM(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M0UM_MASK) >> MPU_RGDAAC_M0UM_SHIFT)
#define MPU_BRD_RGDAAC_M0UM(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M0UM_SHIFT, MPU_RGDAAC_M0UM_WIDTH))

/*! @brief Set the M0UM field to a new value. */
#define MPU_WR_RGDAAC_M0UM(base, index, value) (MPU_RMW_RGDAAC(base, index, MPU_RGDAAC_M0UM_MASK, MPU_RGDAAC_M0UM(value)))
#define MPU_BWR_RGDAAC_M0UM(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M0UM_SHIFT), MPU_RGDAAC_M0UM_SHIFT, MPU_RGDAAC_M0UM_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M0SM[4:3] (RW)
 *
 * See M3SM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M0SM field. */
#define MPU_RD_RGDAAC_M0SM(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M0SM_MASK) >> MPU_RGDAAC_M0SM_SHIFT)
#define MPU_BRD_RGDAAC_M0SM(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M0SM_SHIFT, MPU_RGDAAC_M0SM_WIDTH))

/*! @brief Set the M0SM field to a new value. */
#define MPU_WR_RGDAAC_M0SM(base, index, value) (MPU_RMW_RGDAAC(base, index, MPU_RGDAAC_M0SM_MASK, MPU_RGDAAC_M0SM(value)))
#define MPU_BWR_RGDAAC_M0SM(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M0SM_SHIFT), MPU_RGDAAC_M0SM_SHIFT, MPU_RGDAAC_M0SM_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M0PE[5] (RW)
 *
 * See M3PE description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M0PE field. */
#define MPU_RD_RGDAAC_M0PE(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M0PE_MASK) >> MPU_RGDAAC_M0PE_SHIFT)
#define MPU_BRD_RGDAAC_M0PE(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M0PE_SHIFT, MPU_RGDAAC_M0PE_WIDTH))

