pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*******************************************************************************
 * ROM_PERIPHID2 - Peripheral ID Register
 ******************************************************************************/

/*!
 * @brief ROM_PERIPHID2 - Peripheral ID Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * These registers indicate the peripheral IDs. They are hardwired to specific
 * values used during the auto-discovery process by an external debug agent.
 */
/*!
 * @name Constants and macros for entire ROM_PERIPHID2 register
 */
/*@{*/
#define ROM_RD_PERIPHID2(base)   (ROM_PERIPHID2_REG(base))
/*@}*/

/*******************************************************************************
 * ROM_PERIPHID3 - Peripheral ID Register
 ******************************************************************************/

/*!
 * @brief ROM_PERIPHID3 - Peripheral ID Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * These registers indicate the peripheral IDs. They are hardwired to specific
 * values used during the auto-discovery process by an external debug agent.
 */
/*!
 * @name Constants and macros for entire ROM_PERIPHID3 register
 */
/*@{*/
#define ROM_RD_PERIPHID3(base)   (ROM_PERIPHID3_REG(base))
/*@}*/

/*******************************************************************************
 * ROM_COMPID - Component ID Register
 ******************************************************************************/

/*!
 * @brief ROM_COMPID - Component ID Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * These registers indicate the component IDs. They are hardwired to specific
 * values used during the auto-discovery process by an external debug agent.
 */
/*!
 * @name Constants and macros for entire ROM_COMPID register
 */
/*@{*/
#define ROM_RD_COMPID(base, index) (ROM_COMPID_REG(base, index))
/*@}*/

/*
 * MKM34ZA5 RTC
 *
 * Real Time Clock
 *
 * Registers defined in this header file:
 * - RTC_YEARMON - RTC Year and Month Counters Register
 * - RTC_DAYS - RTC Days and Day-of-Week Counters Register
 * - RTC_HOURMIN - RTC Hours and Minutes Counters Register
 * - RTC_SECONDS - RTC Seconds Counters Register
 * - RTC_ALM_YEARMON - RTC Year and Months Alarm Register
 * - RTC_ALM_DAYS - RTC Days Alarm Register
 * - RTC_ALM_HOURMIN - RTC Hours and Minutes Alarm Register
 * - RTC_ALM_SECONDS - RTC Seconds Alarm Register
 * - RTC_CTRL - RTC Control Register
 * - RTC_STATUS - RTC Status Register
 * - RTC_ISR - RTC Interrupt Status Register
 * - RTC_IER - RTC Interrupt Enable Register
 * - RTC_GP_DATA_REG - RTC General Purpose Data Register
 * - RTC_DST_HOUR - RTC Daylight Saving Hour Register
 * - RTC_DST_MONTH - RTC Daylight Saving Month Register
 * - RTC_DST_DAY - RTC Daylight Saving Day Register
 * - RTC_COMPEN - RTC Compensation Register
 * - RTC_TAMPER_DIRECTION - Tamper Direction Register
 * - RTC_TAMPER_QSCR - Tamper Queue Status and Control Register
 * - RTC_TAMPER_SCR - RTC Tamper Status and Control Register
 * - RTC_FILTER01_CFG - RTC Tamper 0 1 Filter Configuration Register
 * - RTC_FILTER2_CFG - RTC Tamper 2 Filter Configuration Register
 * - RTC_TAMPER_QUEUE - Tamper Queue Register
 * - RTC_CTRL2 - RTC Control 2 Register
 */

#define RTC_INSTANCE_COUNT (1U) /*!< Number of instances of the RTC module. */
#define RTC_IDX (0U) /*!< Instance number for RTC. */

/*******************************************************************************
 * RTC_YEARMON - RTC Year and Month Counters Register
 ******************************************************************************/

/*!
 * @brief RTC_YEARMON - RTC Year and Month Counters Register (RW)
 *
 * Reset value: 0x0001U
 *
 * This register stores the value of the month and year counters. The year field
 * does not store the actual year value but the offset in years from a hardcoded
 * BASE YEAR taken as the year 2112. This is a signed value and the ranges from
 * -128 to +127. The software should program the offset from that base year into
 * this register. For example, if the current year is 2007, then this will be
 * represented in this register as -105 or 0x97. The actual year value can be found
 * by adding the BASE YEAR and the offset in the YEARMON[15:8] register. Hence
 * the range of year supported will be 1984 (2112 - 128) to 2239 (2112 + 127).
 * Hence for year calculation: Actual Year = Base Year (for example, 2112) + Offset
 * Year The month register stores the count value of the months register. Writing
 * to this register loads the months counter with this new value. The valid
 * values are mentioned in table below. Both month and year are unaffected on software
 * reset. User software should first determine the state of the INVAL bit in the
 * STATUS (bit 0) to determine that the counters are stable before their value
 * can be read or changed. The assertion of INVAL bit ensures that no operation is
 * done at the boundary of a second when counters change value.
 */
/*!
 * @name Constants and macros for entire RTC_YEARMON register
 */
/*@{*/
#define RTC_RD_YEARMON(base)     (RTC_YEARMON_REG(base))
#define RTC_WR_YEARMON(base, value) (RTC_YEARMON_REG(base) = (value))
#define RTC_RMW_YEARMON(base, mask, value) (RTC_WR_YEARMON(base, (RTC_RD_YEARMON(base) & ~(mask)) | (value)))
#define RTC_SET_YEARMON(base, value) (BME_OR16(&RTC_YEARMON_REG(base), (uint16_t)(value)))
#define RTC_CLR_YEARMON(base, value) (BME_AND16(&RTC_YEARMON_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_YEARMON(base, value) (BME_XOR16(&RTC_YEARMON_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_YEARMON bitfields
 */

/*!
 * @name Register RTC_YEARMON, field MON_CNT[3:0] (RW)
 *
 * These bits give the value of the Months Counter . Valid Values are:
 *
 * Values:
 * - 0 - Illegal Value
 * - 1 - January
 * - 10 - October
 * - 11 - November
 */
/*@{*/
/*! @brief Read current value of the RTC_YEARMON_MON_CNT field. */
#define RTC_RD_YEARMON_MON_CNT(base) ((RTC_YEARMON_REG(base) & RTC_YEARMON_MON_CNT_MASK) >> RTC_YEARMON_MON_CNT_SHIFT)
#define RTC_BRD_YEARMON_MON_CNT(base) (BME_UBFX16(&RTC_YEARMON_REG(base), RTC_YEARMON_MON_CNT_SHIFT, RTC_YEARMON_MON_CNT_WIDTH))

/*! @brief Set the MON_CNT field to a new value. */
#define RTC_WR_YEARMON_MON_CNT(base, value) (RTC_RMW_YEARMON(base, RTC_YEARMON_MON_CNT_MASK, RTC_YEARMON_MON_CNT(value)))
#define RTC_BWR_YEARMON_MON_CNT(base, value) (BME_BFI16(&RTC_YEARMON_REG(base), ((uint16_t)(value) << RTC_YEARMON_MON_CNT_SHIFT), RTC_YEARMON_MON_CNT_SHIFT, RTC_YEARMON_MON_CNT_WIDTH))
/*@}*/

/*!
 * @name Register RTC_YEARMON, field YROFST[15:8] (RW)
 *
 * These bits indicate the offset in years from the base year (hard coded as
 * 2112) and do not show the actual year value. This is a signed value. Valid values
 * are -128 to 127. With the Base Year as 2112 and if the value of YEAR field is
 * 0x10, the actual year will be 2112 + 16 = 2128.
 */
/*@{*/
/*! @brief Read current value of the RTC_YEARMON_YROFST field. */
#define RTC_RD_YEARMON_YROFST(base) ((RTC_YEARMON_REG(base) & RTC_YEARMON_YROFST_MASK) >> RTC_YEARMON_YROFST_SHIFT)
#define RTC_BRD_YEARMON_YROFST(base) (BME_UBFX16(&RTC_YEARMON_REG(base), RTC_YEARMON_YROFST_SHIFT, RTC_YEARMON_YROFST_WIDTH))

/*! @brief Set the YROFST field to a new value. */
#define RTC_WR_YEARMON_YROFST(base, value) (RTC_RMW_YEARMON(base, RTC_YEARMON_YROFST_MASK, RTC_YEARMON_YROFST(value)))
#define RTC_BWR_YEARMON_YROFST(base, value) (BME_BFI16(&RTC_YEARMON_REG(base), ((uint16_t)(value) << RTC_YEARMON_YROFST_SHIFT), RTC_YEARMON_YROFST_SHIFT, RTC_YEARMON_YROFST_WIDTH))
/*@}*/

