pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*
 * Constants & macros for individual RTC_ALM_DAYS bitfields
 */

/*!
 * @name Register RTC_ALM_DAYS, field ALM_DAY[4:0] (RW)
 *
 * Same as Days Counter Value in DAYS RTC Days and Day-of-Week Counters Register
 * .
 */
/*@{*/
/*! @brief Read current value of the RTC_ALM_DAYS_ALM_DAY field. */
#define RTC_RD_ALM_DAYS_ALM_DAY(base) ((RTC_ALM_DAYS_REG(base) & RTC_ALM_DAYS_ALM_DAY_MASK) >> RTC_ALM_DAYS_ALM_DAY_SHIFT)
#define RTC_BRD_ALM_DAYS_ALM_DAY(base) (BME_UBFX16(&RTC_ALM_DAYS_REG(base), RTC_ALM_DAYS_ALM_DAY_SHIFT, RTC_ALM_DAYS_ALM_DAY_WIDTH))

/*! @brief Set the ALM_DAY field to a new value. */
#define RTC_WR_ALM_DAYS_ALM_DAY(base, value) (RTC_RMW_ALM_DAYS(base, RTC_ALM_DAYS_ALM_DAY_MASK, RTC_ALM_DAYS_ALM_DAY(value)))
#define RTC_BWR_ALM_DAYS_ALM_DAY(base, value) (BME_BFI16(&RTC_ALM_DAYS_REG(base), ((uint16_t)(value) << RTC_ALM_DAYS_ALM_DAY_SHIFT), RTC_ALM_DAYS_ALM_DAY_SHIFT, RTC_ALM_DAYS_ALM_DAY_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_ALM_HOURMIN - RTC Hours and Minutes Alarm Register
 ******************************************************************************/

/*!
 * @brief RTC_ALM_HOURMIN - RTC Hours and Minutes Alarm Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The hours and minutes alarm register is used to configure the hour and minute
 * setting of the alarm. The alarm setting can be read or written anytime. This
 * register is reset to default state on software reset. User software can
 * configure the type of alarm using the ALM_TYPE bits in the CTRL register.
 */
/*!
 * @name Constants and macros for entire RTC_ALM_HOURMIN register
 */
/*@{*/
#define RTC_RD_ALM_HOURMIN(base) (RTC_ALM_HOURMIN_REG(base))
#define RTC_WR_ALM_HOURMIN(base, value) (RTC_ALM_HOURMIN_REG(base) = (value))
#define RTC_RMW_ALM_HOURMIN(base, mask, value) (RTC_WR_ALM_HOURMIN(base, (RTC_RD_ALM_HOURMIN(base) & ~(mask)) | (value)))
#define RTC_SET_ALM_HOURMIN(base, value) (BME_OR16(&RTC_ALM_HOURMIN_REG(base), (uint16_t)(value)))
#define RTC_CLR_ALM_HOURMIN(base, value) (BME_AND16(&RTC_ALM_HOURMIN_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_ALM_HOURMIN(base, value) (BME_XOR16(&RTC_ALM_HOURMIN_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_ALM_HOURMIN bitfields
 */

/*!
 * @name Register RTC_ALM_HOURMIN, field ALM_MIN[5:0] (RW)
 *
 * Same as Minutes Counter Value in HOURMINRTC Hours and Minutes Counters
 * Register .
 */
/*@{*/
/*! @brief Read current value of the RTC_ALM_HOURMIN_ALM_MIN field. */
#define RTC_RD_ALM_HOURMIN_ALM_MIN(base) ((RTC_ALM_HOURMIN_REG(base) & RTC_ALM_HOURMIN_ALM_MIN_MASK) >> RTC_ALM_HOURMIN_ALM_MIN_SHIFT)
#define RTC_BRD_ALM_HOURMIN_ALM_MIN(base) (BME_UBFX16(&RTC_ALM_HOURMIN_REG(base), RTC_ALM_HOURMIN_ALM_MIN_SHIFT, RTC_ALM_HOURMIN_ALM_MIN_WIDTH))

/*! @brief Set the ALM_MIN field to a new value. */
#define RTC_WR_ALM_HOURMIN_ALM_MIN(base, value) (RTC_RMW_ALM_HOURMIN(base, RTC_ALM_HOURMIN_ALM_MIN_MASK, RTC_ALM_HOURMIN_ALM_MIN(value)))
#define RTC_BWR_ALM_HOURMIN_ALM_MIN(base, value) (BME_BFI16(&RTC_ALM_HOURMIN_REG(base), ((uint16_t)(value) << RTC_ALM_HOURMIN_ALM_MIN_SHIFT), RTC_ALM_HOURMIN_ALM_MIN_SHIFT, RTC_ALM_HOURMIN_ALM_MIN_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ALM_HOURMIN, field ALM_HOUR[12:8] (RW)
 *
 * Same as Hours Counter Value in HOURMINRTC Hours and Minutes Counters Register
 * .
 */
/*@{*/
/*! @brief Read current value of the RTC_ALM_HOURMIN_ALM_HOUR field. */
#define RTC_RD_ALM_HOURMIN_ALM_HOUR(base) ((RTC_ALM_HOURMIN_REG(base) & RTC_ALM_HOURMIN_ALM_HOUR_MASK) >> RTC_ALM_HOURMIN_ALM_HOUR_SHIFT)
#define RTC_BRD_ALM_HOURMIN_ALM_HOUR(base) (BME_UBFX16(&RTC_ALM_HOURMIN_REG(base), RTC_ALM_HOURMIN_ALM_HOUR_SHIFT, RTC_ALM_HOURMIN_ALM_HOUR_WIDTH))

/*! @brief Set the ALM_HOUR field to a new value. */
#define RTC_WR_ALM_HOURMIN_ALM_HOUR(base, value) (RTC_RMW_ALM_HOURMIN(base, RTC_ALM_HOURMIN_ALM_HOUR_MASK, RTC_ALM_HOURMIN_ALM_HOUR(value)))
#define RTC_BWR_ALM_HOURMIN_ALM_HOUR(base, value) (BME_BFI16(&RTC_ALM_HOURMIN_REG(base), ((uint16_t)(value) << RTC_ALM_HOURMIN_ALM_HOUR_SHIFT), RTC_ALM_HOURMIN_ALM_HOUR_SHIFT, RTC_ALM_HOURMIN_ALM_HOUR_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_ALM_SECONDS - RTC Seconds Alarm Register
 ******************************************************************************/

/*!
 * @brief RTC_ALM_SECONDS - RTC Seconds Alarm Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The seconds alarm register is used to configure the seconds setting of the
 * alarm. The alarm setting can be read or written anytime. This register is reset
 * to default value on software reset. Bits 9:8 provide option to the user
 * software to perform correction on seconds counter to compensate for the leap
 * seconds. Write to these bits adds or subtracts 1 from the seconds counter and read
 * returns zeros. User software should first determine the state of the INVAL bit
 * in the STATUS (bit 0) to determine that the counters are stable before they can
 * be incremented or decremented. The assertion of INVAL bit ensures that no
 * operation is done at the boundary of a second when counters change value. User
 * software can configure the type of alarm using the ALM_TYPE bits in the CTRL
 * register.
 */
/*!
 * @name Constants and macros for entire RTC_ALM_SECONDS register
 */
/*@{*/
#define RTC_RD_ALM_SECONDS(base) (RTC_ALM_SECONDS_REG(base))
#define RTC_WR_ALM_SECONDS(base, value) (RTC_ALM_SECONDS_REG(base) = (value))
#define RTC_RMW_ALM_SECONDS(base, mask, value) (RTC_WR_ALM_SECONDS(base, (RTC_RD_ALM_SECONDS(base) & ~(mask)) | (value)))
#define RTC_SET_ALM_SECONDS(base, value) (BME_OR16(&RTC_ALM_SECONDS_REG(base), (uint16_t)(value)))
#define RTC_CLR_ALM_SECONDS(base, value) (BME_AND16(&RTC_ALM_SECONDS_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_ALM_SECONDS(base, value) (BME_XOR16(&RTC_ALM_SECONDS_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_ALM_SECONDS bitfields
 */

/*!
 * @name Register RTC_ALM_SECONDS, field ALM_SEC[5:0] (RW)
 *
 * Seconds Value for Alarm. Same as Seconds Counter Value in SECONDSRTC Seconds
 * Counters Register .
 */
/*@{*/
/*! @brief Read current value of the RTC_ALM_SECONDS_ALM_SEC field. */
#define RTC_RD_ALM_SECONDS_ALM_SEC(base) ((RTC_ALM_SECONDS_REG(base) & RTC_ALM_SECONDS_ALM_SEC_MASK) >> RTC_ALM_SECONDS_ALM_SEC_SHIFT)
#define RTC_BRD_ALM_SECONDS_ALM_SEC(base) (BME_UBFX16(&RTC_ALM_SECONDS_REG(base), RTC_ALM_SECONDS_ALM_SEC_SHIFT, RTC_ALM_SECONDS_ALM_SEC_WIDTH))

