pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*! @brief Set the ALM_SEC field to a new value. */
#define RTC_WR_ALM_SECONDS_ALM_SEC(base, value) (RTC_RMW_ALM_SECONDS(base, RTC_ALM_SECONDS_ALM_SEC_MASK, RTC_ALM_SECONDS_ALM_SEC(value)))
#define RTC_BWR_ALM_SECONDS_ALM_SEC(base, value) (BME_BFI16(&RTC_ALM_SECONDS_REG(base), ((uint16_t)(value) << RTC_ALM_SECONDS_ALM_SEC_SHIFT), RTC_ALM_SECONDS_ALM_SEC_SHIFT, RTC_ALM_SECONDS_ALM_SEC_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ALM_SECONDS, field DEC_SEC[8] (WORZ)
 *
 * This bit controls the decrement of seconds counter incase the software wants
 * to make corrections to the seconds counter to compensate for the leap seconds
 * or to perform fine trimming of time when needed. Write to this bit has
 * decrements the seconds counter and then the bit gets cleared on next posedge of bus
 * clock.
 */
/*@{*/
/*! @brief Set the DEC_SEC field to a new value. */
#define RTC_WR_ALM_SECONDS_DEC_SEC(base, value) (RTC_RMW_ALM_SECONDS(base, RTC_ALM_SECONDS_DEC_SEC_MASK, RTC_ALM_SECONDS_DEC_SEC(value)))
#define RTC_BWR_ALM_SECONDS_DEC_SEC(base, value) (BME_BFI16(&RTC_ALM_SECONDS_REG(base), ((uint16_t)(value) << RTC_ALM_SECONDS_DEC_SEC_SHIFT), RTC_ALM_SECONDS_DEC_SEC_SHIFT, RTC_ALM_SECONDS_DEC_SEC_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ALM_SECONDS, field INC_SEC[9] (WORZ)
 *
 * This bit controls the increment of seconds counter incase the software wants
 * to make corrections to the seconds counter to compensate for the leap seconds
 * or to perform fine trimming of time when needed. Write to this bit increments
 * the seconds counter and then the bit gets cleared on next posedge.
 */
/*@{*/
/*! @brief Set the INC_SEC field to a new value. */
#define RTC_WR_ALM_SECONDS_INC_SEC(base, value) (RTC_RMW_ALM_SECONDS(base, RTC_ALM_SECONDS_INC_SEC_MASK, RTC_ALM_SECONDS_INC_SEC(value)))
#define RTC_BWR_ALM_SECONDS_INC_SEC(base, value) (BME_BFI16(&RTC_ALM_SECONDS_REG(base), ((uint16_t)(value) << RTC_ALM_SECONDS_INC_SEC_SHIFT), RTC_ALM_SECONDS_INC_SEC_SHIFT, RTC_ALM_SECONDS_INC_SEC_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_CTRL - RTC Control Register
 ******************************************************************************/

/*!
 * @brief RTC_CTRL - RTC Control Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This is the control register and governs all operations being done inside the
 * RTC. This register is used to specify the software reset, daylight controls,
 * and the type of alarm function needed.
 */
/*!
 * @name Constants and macros for entire RTC_CTRL register
 */
/*@{*/
#define RTC_RD_CTRL(base)        (RTC_CTRL_REG(base))
#define RTC_WR_CTRL(base, value) (RTC_CTRL_REG(base) = (value))
#define RTC_RMW_CTRL(base, mask, value) (RTC_WR_CTRL(base, (RTC_RD_CTRL(base) & ~(mask)) | (value)))
#define RTC_SET_CTRL(base, value) (BME_OR16(&RTC_CTRL_REG(base), (uint16_t)(value)))
#define RTC_CLR_CTRL(base, value) (BME_AND16(&RTC_CTRL_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_CTRL(base, value) (BME_XOR16(&RTC_CTRL_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_CTRL bitfields
 */

/*!
 * @name Register RTC_CTRL, field FINEEN[0] (RW)
 *
 * Values:
 * - 1 - Fine compensation is enabled.
 * - 0 - Fine compensation is disabled
 */
/*@{*/
/*! @brief Read current value of the RTC_CTRL_FINEEN field. */
#define RTC_RD_CTRL_FINEEN(base) ((RTC_CTRL_REG(base) & RTC_CTRL_FINEEN_MASK) >> RTC_CTRL_FINEEN_SHIFT)
#define RTC_BRD_CTRL_FINEEN(base) (BME_UBFX16(&RTC_CTRL_REG(base), RTC_CTRL_FINEEN_SHIFT, RTC_CTRL_FINEEN_WIDTH))

/*! @brief Set the FINEEN field to a new value. */
#define RTC_WR_CTRL_FINEEN(base, value) (RTC_RMW_CTRL(base, RTC_CTRL_FINEEN_MASK, RTC_CTRL_FINEEN(value)))
#define RTC_BWR_CTRL_FINEEN(base, value) (BME_BFI16(&RTC_CTRL_REG(base), ((uint16_t)(value) << RTC_CTRL_FINEEN_SHIFT), RTC_CTRL_FINEEN_SHIFT, RTC_CTRL_FINEEN_WIDTH))
/*@}*/

/*!
 * @name Register RTC_CTRL, field COMP_EN[1] (RW)
 *
 * Compensation enable bit 1'b0:- Coarse Compensation is disabled. 1'b1:- Coarse
 * Compensation is enabled. Note:- If both the bits are meant to be set "1'b1"
 * hardware will not let the COMP_EN bit to be written 1.
 */
/*@{*/
/*! @brief Read current value of the RTC_CTRL_COMP_EN field. */
#define RTC_RD_CTRL_COMP_EN(base) ((RTC_CTRL_REG(base) & RTC_CTRL_COMP_EN_MASK) >> RTC_CTRL_COMP_EN_SHIFT)
#define RTC_BRD_CTRL_COMP_EN(base) (BME_UBFX16(&RTC_CTRL_REG(base), RTC_CTRL_COMP_EN_SHIFT, RTC_CTRL_COMP_EN_WIDTH))

/*! @brief Set the COMP_EN field to a new value. */
#define RTC_WR_CTRL_COMP_EN(base, value) (RTC_RMW_CTRL(base, RTC_CTRL_COMP_EN_MASK, RTC_CTRL_COMP_EN(value)))
#define RTC_BWR_CTRL_COMP_EN(base, value) (BME_BFI16(&RTC_CTRL_REG(base), ((uint16_t)(value) << RTC_CTRL_COMP_EN_SHIFT), RTC_CTRL_COMP_EN_SHIFT, RTC_CTRL_COMP_EN_WIDTH))
/*@}*/

/*!
 * @name Register RTC_CTRL, field ALM_MATCH[3:2] (RW)
 *
 * These bits define the type of alarm function. These bits select which time
 * and calendar counters will be used for matching and generate an alarm.
 *
 * Values:
 * - 00 - Only Seconds, Minutes, and Hours matched.
 * - 01 - Only Seconds, Minutes, Hours, and Days matched.
 * - 10 - Only Seconds, Minutes, Hours, Days, and Months matched.
 */
/*@{*/
/*! @brief Read current value of the RTC_CTRL_ALM_MATCH field. */
#define RTC_RD_CTRL_ALM_MATCH(base) ((RTC_CTRL_REG(base) & RTC_CTRL_ALM_MATCH_MASK) >> RTC_CTRL_ALM_MATCH_SHIFT)
#define RTC_BRD_CTRL_ALM_MATCH(base) (BME_UBFX16(&RTC_CTRL_REG(base), RTC_CTRL_ALM_MATCH_SHIFT, RTC_CTRL_ALM_MATCH_WIDTH))

/*! @brief Set the ALM_MATCH field to a new value. */
#define RTC_WR_CTRL_ALM_MATCH(base, value) (RTC_RMW_CTRL(base, RTC_CTRL_ALM_MATCH_MASK, RTC_CTRL_ALM_MATCH(value)))
#define RTC_BWR_CTRL_ALM_MATCH(base, value) (BME_BFI16(&RTC_CTRL_REG(base), ((uint16_t)(value) << RTC_CTRL_ALM_MATCH_SHIFT), RTC_CTRL_ALM_MATCH_SHIFT, RTC_CTRL_ALM_MATCH_WIDTH))
/*@}*/

/*!
 * @name Register RTC_CTRL, field TIMER_STB_MASK[4] (RW)
 *
 * Values:
 * - 1 - Sampling clocks are gated in standby mode
 * - 0 - Sampling clocks are not gated when in standby mode
 */
/*@{*/
/*! @brief Read current value of the RTC_CTRL_TIMER_STB_MASK field. */
#define RTC_RD_CTRL_TIMER_STB_MASK(base) ((RTC_CTRL_REG(base) & RTC_CTRL_TIMER_STB_MASK_MASK) >> RTC_CTRL_TIMER_STB_MASK_SHIFT)
#define RTC_BRD_CTRL_TIMER_STB_MASK(base) (BME_UBFX16(&RTC_CTRL_REG(base), RTC_CTRL_TIMER_STB_MASK_SHIFT, RTC_CTRL_TIMER_STB_MASK_WIDTH))

/*! @brief Set the TIMER_STB_MASK field to a new value. */
#define RTC_WR_CTRL_TIMER_STB_MASK(base, value) (RTC_RMW_CTRL(base, RTC_CTRL_TIMER_STB_MASK_MASK, RTC_CTRL_TIMER_STB_MASK(value)))
#define RTC_BWR_CTRL_TIMER_STB_MASK(base, value) (BME_BFI16(&RTC_CTRL_REG(base), ((uint16_t)(value) << RTC_CTRL_TIMER_STB_MASK_SHIFT), RTC_CTRL_TIMER_STB_MASK_SHIFT, RTC_CTRL_TIMER_STB_MASK_WIDTH))
/*@}*/

/*!
 * @name Register RTC_CTRL, field DST_EN[6] (RW)
 *
 * The date and time for daylight saving changes are stored in the Daylight
 * Saving Registers. These registers can be changed when this bit is 0. Once this bit
 * is set, those registers cannot be changed and when time and date match the
 * values in those registers, daylight adjustment will happen. To disable Daylight
 * Saving function, this bit should be set to 0.
 *
 * Values:
 * - 0 - Disabled. Daylight saving changes are not applied. Daylight saving
 *     registers can be modified.
 * - 1 - Enabled. Daylight saving changes are applied.
 */
/*@{*/
/*! @brief Read current value of the RTC_CTRL_DST_EN field. */
#define RTC_RD_CTRL_DST_EN(base) ((RTC_CTRL_REG(base) & RTC_CTRL_DST_EN_MASK) >> RTC_CTRL_DST_EN_SHIFT)
#define RTC_BRD_CTRL_DST_EN(base) (BME_UBFX16(&RTC_CTRL_REG(base), RTC_CTRL_DST_EN_SHIFT, RTC_CTRL_DST_EN_WIDTH))

