pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*! @brief Set the IS_4HZ field to a new value. */
#define RTC_WR_ISR_IS_4HZ(base, value) (RTC_RMW_ISR(base, (RTC_ISR_IS_4HZ_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_256HZ_MASK | RTC_ISR_IS_512HZ_MASK), RTC_ISR_IS_4HZ(value)))
#define RTC_BWR_ISR_IS_4HZ(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_IS_4HZ_SHIFT), RTC_ISR_IS_4HZ_SHIFT, RTC_ISR_IS_4HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field IS_8HZ[9] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_IS_8HZ field. */
#define RTC_RD_ISR_IS_8HZ(base) ((RTC_ISR_REG(base) & RTC_ISR_IS_8HZ_MASK) >> RTC_ISR_IS_8HZ_SHIFT)
#define RTC_BRD_ISR_IS_8HZ(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_IS_8HZ_SHIFT, RTC_ISR_IS_8HZ_WIDTH))

/*! @brief Set the IS_8HZ field to a new value. */
#define RTC_WR_ISR_IS_8HZ(base, value) (RTC_RMW_ISR(base, (RTC_ISR_IS_8HZ_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_256HZ_MASK | RTC_ISR_IS_512HZ_MASK), RTC_ISR_IS_8HZ(value)))
#define RTC_BWR_ISR_IS_8HZ(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_IS_8HZ_SHIFT), RTC_ISR_IS_8HZ_SHIFT, RTC_ISR_IS_8HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field IS_16HZ[10] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_IS_16HZ field. */
#define RTC_RD_ISR_IS_16HZ(base) ((RTC_ISR_REG(base) & RTC_ISR_IS_16HZ_MASK) >> RTC_ISR_IS_16HZ_SHIFT)
#define RTC_BRD_ISR_IS_16HZ(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_IS_16HZ_SHIFT, RTC_ISR_IS_16HZ_WIDTH))

/*! @brief Set the IS_16HZ field to a new value. */
#define RTC_WR_ISR_IS_16HZ(base, value) (RTC_RMW_ISR(base, (RTC_ISR_IS_16HZ_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_256HZ_MASK | RTC_ISR_IS_512HZ_MASK), RTC_ISR_IS_16HZ(value)))
#define RTC_BWR_ISR_IS_16HZ(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_IS_16HZ_SHIFT), RTC_ISR_IS_16HZ_SHIFT, RTC_ISR_IS_16HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field IS_32HZ[11] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_IS_32HZ field. */
#define RTC_RD_ISR_IS_32HZ(base) ((RTC_ISR_REG(base) & RTC_ISR_IS_32HZ_MASK) >> RTC_ISR_IS_32HZ_SHIFT)
#define RTC_BRD_ISR_IS_32HZ(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_IS_32HZ_SHIFT, RTC_ISR_IS_32HZ_WIDTH))

/*! @brief Set the IS_32HZ field to a new value. */
#define RTC_WR_ISR_IS_32HZ(base, value) (RTC_RMW_ISR(base, (RTC_ISR_IS_32HZ_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_256HZ_MASK | RTC_ISR_IS_512HZ_MASK), RTC_ISR_IS_32HZ(value)))
#define RTC_BWR_ISR_IS_32HZ(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_IS_32HZ_SHIFT), RTC_ISR_IS_32HZ_SHIFT, RTC_ISR_IS_32HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field IS_64HZ[12] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_IS_64HZ field. */
#define RTC_RD_ISR_IS_64HZ(base) ((RTC_ISR_REG(base) & RTC_ISR_IS_64HZ_MASK) >> RTC_ISR_IS_64HZ_SHIFT)
#define RTC_BRD_ISR_IS_64HZ(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_IS_64HZ_SHIFT, RTC_ISR_IS_64HZ_WIDTH))

/*! @brief Set the IS_64HZ field to a new value. */
#define RTC_WR_ISR_IS_64HZ(base, value) (RTC_RMW_ISR(base, (RTC_ISR_IS_64HZ_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_256HZ_MASK | RTC_ISR_IS_512HZ_MASK), RTC_ISR_IS_64HZ(value)))
#define RTC_BWR_ISR_IS_64HZ(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_IS_64HZ_SHIFT), RTC_ISR_IS_64HZ_SHIFT, RTC_ISR_IS_64HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field IS_128HZ[13] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_IS_128HZ field. */
#define RTC_RD_ISR_IS_128HZ(base) ((RTC_ISR_REG(base) & RTC_ISR_IS_128HZ_MASK) >> RTC_ISR_IS_128HZ_SHIFT)
#define RTC_BRD_ISR_IS_128HZ(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_IS_128HZ_SHIFT, RTC_ISR_IS_128HZ_WIDTH))

/*! @brief Set the IS_128HZ field to a new value. */
#define RTC_WR_ISR_IS_128HZ(base, value) (RTC_RMW_ISR(base, (RTC_ISR_IS_128HZ_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_256HZ_MASK | RTC_ISR_IS_512HZ_MASK), RTC_ISR_IS_128HZ(value)))
#define RTC_BWR_ISR_IS_128HZ(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_IS_128HZ_SHIFT), RTC_ISR_IS_128HZ_SHIFT, RTC_ISR_IS_128HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field IS_256HZ[14] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_IS_256HZ field. */
#define RTC_RD_ISR_IS_256HZ(base) ((RTC_ISR_REG(base) & RTC_ISR_IS_256HZ_MASK) >> RTC_ISR_IS_256HZ_SHIFT)
#define RTC_BRD_ISR_IS_256HZ(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_IS_256HZ_SHIFT, RTC_ISR_IS_256HZ_WIDTH))

/*! @brief Set the IS_256HZ field to a new value. */
#define RTC_WR_ISR_IS_256HZ(base, value) (RTC_RMW_ISR(base, (RTC_ISR_IS_256HZ_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_512HZ_MASK), RTC_ISR_IS_256HZ(value)))
#define RTC_BWR_ISR_IS_256HZ(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_IS_256HZ_SHIFT), RTC_ISR_IS_256HZ_SHIFT, RTC_ISR_IS_256HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field IS_512HZ[15] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_IS_512HZ field. */
#define RTC_RD_ISR_IS_512HZ(base) ((RTC_ISR_REG(base) & RTC_ISR_IS_512HZ_MASK) >> RTC_ISR_IS_512HZ_SHIFT)
#define RTC_BRD_ISR_IS_512HZ(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_IS_512HZ_SHIFT, RTC_ISR_IS_512HZ_WIDTH))

/*! @brief Set the IS_512HZ field to a new value. */
#define RTC_WR_ISR_IS_512HZ(base, value) (RTC_RMW_ISR(base, (RTC_ISR_IS_512HZ_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_256HZ_MASK), RTC_ISR_IS_512HZ(value)))
#define RTC_BWR_ISR_IS_512HZ(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_IS_512HZ_SHIFT), RTC_ISR_IS_512HZ_SHIFT, RTC_ISR_IS_512HZ_WIDTH))
/*@}*/

