pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*! @brief Set the IE_2HZ field to a new value. */
#define RTC_WR_IER_IE_2HZ(base, value) (RTC_RMW_IER(base, RTC_IER_IE_2HZ_MASK, RTC_IER_IE_2HZ(value)))
#define RTC_BWR_IER_IE_2HZ(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_IE_2HZ_SHIFT), RTC_IER_IE_2HZ_SHIFT, RTC_IER_IE_2HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field IE_4HZ[8] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_IE_4HZ field. */
#define RTC_RD_IER_IE_4HZ(base) ((RTC_IER_REG(base) & RTC_IER_IE_4HZ_MASK) >> RTC_IER_IE_4HZ_SHIFT)
#define RTC_BRD_IER_IE_4HZ(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_IE_4HZ_SHIFT, RTC_IER_IE_4HZ_WIDTH))

/*! @brief Set the IE_4HZ field to a new value. */
#define RTC_WR_IER_IE_4HZ(base, value) (RTC_RMW_IER(base, RTC_IER_IE_4HZ_MASK, RTC_IER_IE_4HZ(value)))
#define RTC_BWR_IER_IE_4HZ(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_IE_4HZ_SHIFT), RTC_IER_IE_4HZ_SHIFT, RTC_IER_IE_4HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field IE_8HZ[9] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_IE_8HZ field. */
#define RTC_RD_IER_IE_8HZ(base) ((RTC_IER_REG(base) & RTC_IER_IE_8HZ_MASK) >> RTC_IER_IE_8HZ_SHIFT)
#define RTC_BRD_IER_IE_8HZ(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_IE_8HZ_SHIFT, RTC_IER_IE_8HZ_WIDTH))

/*! @brief Set the IE_8HZ field to a new value. */
#define RTC_WR_IER_IE_8HZ(base, value) (RTC_RMW_IER(base, RTC_IER_IE_8HZ_MASK, RTC_IER_IE_8HZ(value)))
#define RTC_BWR_IER_IE_8HZ(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_IE_8HZ_SHIFT), RTC_IER_IE_8HZ_SHIFT, RTC_IER_IE_8HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field IE_16HZ[10] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_IE_16HZ field. */
#define RTC_RD_IER_IE_16HZ(base) ((RTC_IER_REG(base) & RTC_IER_IE_16HZ_MASK) >> RTC_IER_IE_16HZ_SHIFT)
#define RTC_BRD_IER_IE_16HZ(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_IE_16HZ_SHIFT, RTC_IER_IE_16HZ_WIDTH))

/*! @brief Set the IE_16HZ field to a new value. */
#define RTC_WR_IER_IE_16HZ(base, value) (RTC_RMW_IER(base, RTC_IER_IE_16HZ_MASK, RTC_IER_IE_16HZ(value)))
#define RTC_BWR_IER_IE_16HZ(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_IE_16HZ_SHIFT), RTC_IER_IE_16HZ_SHIFT, RTC_IER_IE_16HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field IE_32HZ[11] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_IE_32HZ field. */
#define RTC_RD_IER_IE_32HZ(base) ((RTC_IER_REG(base) & RTC_IER_IE_32HZ_MASK) >> RTC_IER_IE_32HZ_SHIFT)
#define RTC_BRD_IER_IE_32HZ(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_IE_32HZ_SHIFT, RTC_IER_IE_32HZ_WIDTH))

/*! @brief Set the IE_32HZ field to a new value. */
#define RTC_WR_IER_IE_32HZ(base, value) (RTC_RMW_IER(base, RTC_IER_IE_32HZ_MASK, RTC_IER_IE_32HZ(value)))
#define RTC_BWR_IER_IE_32HZ(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_IE_32HZ_SHIFT), RTC_IER_IE_32HZ_SHIFT, RTC_IER_IE_32HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field IE_64HZ[12] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_IE_64HZ field. */
#define RTC_RD_IER_IE_64HZ(base) ((RTC_IER_REG(base) & RTC_IER_IE_64HZ_MASK) >> RTC_IER_IE_64HZ_SHIFT)
#define RTC_BRD_IER_IE_64HZ(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_IE_64HZ_SHIFT, RTC_IER_IE_64HZ_WIDTH))

/*! @brief Set the IE_64HZ field to a new value. */
#define RTC_WR_IER_IE_64HZ(base, value) (RTC_RMW_IER(base, RTC_IER_IE_64HZ_MASK, RTC_IER_IE_64HZ(value)))
#define RTC_BWR_IER_IE_64HZ(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_IE_64HZ_SHIFT), RTC_IER_IE_64HZ_SHIFT, RTC_IER_IE_64HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field IE_128HZ[13] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_IE_128HZ field. */
#define RTC_RD_IER_IE_128HZ(base) ((RTC_IER_REG(base) & RTC_IER_IE_128HZ_MASK) >> RTC_IER_IE_128HZ_SHIFT)
#define RTC_BRD_IER_IE_128HZ(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_IE_128HZ_SHIFT, RTC_IER_IE_128HZ_WIDTH))

/*! @brief Set the IE_128HZ field to a new value. */
#define RTC_WR_IER_IE_128HZ(base, value) (RTC_RMW_IER(base, RTC_IER_IE_128HZ_MASK, RTC_IER_IE_128HZ(value)))
#define RTC_BWR_IER_IE_128HZ(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_IE_128HZ_SHIFT), RTC_IER_IE_128HZ_SHIFT, RTC_IER_IE_128HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field IE_256HZ[14] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_IE_256HZ field. */
#define RTC_RD_IER_IE_256HZ(base) ((RTC_IER_REG(base) & RTC_IER_IE_256HZ_MASK) >> RTC_IER_IE_256HZ_SHIFT)
#define RTC_BRD_IER_IE_256HZ(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_IE_256HZ_SHIFT, RTC_IER_IE_256HZ_WIDTH))

/*! @brief Set the IE_256HZ field to a new value. */
#define RTC_WR_IER_IE_256HZ(base, value) (RTC_RMW_IER(base, RTC_IER_IE_256HZ_MASK, RTC_IER_IE_256HZ(value)))
#define RTC_BWR_IER_IE_256HZ(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_IE_256HZ_SHIFT), RTC_IER_IE_256HZ_SHIFT, RTC_IER_IE_256HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field IE_512HZ[15] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_IE_512HZ field. */
#define RTC_RD_IER_IE_512HZ(base) ((RTC_IER_REG(base) & RTC_IER_IE_512HZ_MASK) >> RTC_IER_IE_512HZ_SHIFT)
#define RTC_BRD_IER_IE_512HZ(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_IE_512HZ_SHIFT, RTC_IER_IE_512HZ_WIDTH))

/*! @brief Set the IE_512HZ field to a new value. */
#define RTC_WR_IER_IE_512HZ(base, value) (RTC_RMW_IER(base, RTC_IER_IE_512HZ_MASK, RTC_IER_IE_512HZ(value)))
#define RTC_BWR_IER_IE_512HZ(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_IE_512HZ_SHIFT), RTC_IER_IE_512HZ_SHIFT, RTC_IER_IE_512HZ_WIDTH))
/*@}*/

