pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*
 * Constants & macros for individual RTC_DST_MONTH bitfields
 */

/*!
 * @name Register RTC_DST_MONTH, field DST_END_MONTH[3:0] (RW)
 *
 * This is the month value for the time when DST is reversed. See the YEARMONRTC
 * Year and Month Counters Register .
 */
/*@{*/
/*! @brief Read current value of the RTC_DST_MONTH_DST_END_MONTH field. */
#define RTC_RD_DST_MONTH_DST_END_MONTH(base) ((RTC_DST_MONTH_REG(base) & RTC_DST_MONTH_DST_END_MONTH_MASK) >> RTC_DST_MONTH_DST_END_MONTH_SHIFT)
#define RTC_BRD_DST_MONTH_DST_END_MONTH(base) (BME_UBFX16(&RTC_DST_MONTH_REG(base), RTC_DST_MONTH_DST_END_MONTH_SHIFT, RTC_DST_MONTH_DST_END_MONTH_WIDTH))

/*! @brief Set the DST_END_MONTH field to a new value. */
#define RTC_WR_DST_MONTH_DST_END_MONTH(base, value) (RTC_RMW_DST_MONTH(base, RTC_DST_MONTH_DST_END_MONTH_MASK, RTC_DST_MONTH_DST_END_MONTH(value)))
#define RTC_BWR_DST_MONTH_DST_END_MONTH(base, value) (BME_BFI16(&RTC_DST_MONTH_REG(base), ((uint16_t)(value) << RTC_DST_MONTH_DST_END_MONTH_SHIFT), RTC_DST_MONTH_DST_END_MONTH_SHIFT, RTC_DST_MONTH_DST_END_MONTH_WIDTH))
/*@}*/

/*!
 * @name Register RTC_DST_MONTH, field DST_START_MONTH[11:8] (RW)
 *
 * This is the month value for the time when DST comes in to effect. See the
 * YEARMONRTC Year and Month Counters Register .
 */
/*@{*/
/*! @brief Read current value of the RTC_DST_MONTH_DST_START_MONTH field. */
#define RTC_RD_DST_MONTH_DST_START_MONTH(base) ((RTC_DST_MONTH_REG(base) & RTC_DST_MONTH_DST_START_MONTH_MASK) >> RTC_DST_MONTH_DST_START_MONTH_SHIFT)
#define RTC_BRD_DST_MONTH_DST_START_MONTH(base) (BME_UBFX16(&RTC_DST_MONTH_REG(base), RTC_DST_MONTH_DST_START_MONTH_SHIFT, RTC_DST_MONTH_DST_START_MONTH_WIDTH))

/*! @brief Set the DST_START_MONTH field to a new value. */
#define RTC_WR_DST_MONTH_DST_START_MONTH(base, value) (RTC_RMW_DST_MONTH(base, RTC_DST_MONTH_DST_START_MONTH_MASK, RTC_DST_MONTH_DST_START_MONTH(value)))
#define RTC_BWR_DST_MONTH_DST_START_MONTH(base, value) (BME_BFI16(&RTC_DST_MONTH_REG(base), ((uint16_t)(value) << RTC_DST_MONTH_DST_START_MONTH_SHIFT), RTC_DST_MONTH_DST_START_MONTH_SHIFT, RTC_DST_MONTH_DST_START_MONTH_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_DST_DAY - RTC Daylight Saving Day Register
 ******************************************************************************/

/*!
 * @brief RTC_DST_DAY - RTC Daylight Saving Day Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register stores the day when the Daylight Saving has to be applied or
 * reversed. This register is programmable when the DST_EN bit in CTRL register is
 * Zero. When DST_EN bit is set, the contents of this register cannot be changed.
 * The CPU should program the correct day value (1 - 31) as per the regional
 * settings. For example, if the Daylight Saving starts at March 25 and ends at
 * October 28 in 2007. Hence the CPU should write 0x191C in this register. This
 * register is unaffected by software reset.
 */
/*!
 * @name Constants and macros for entire RTC_DST_DAY register
 */
/*@{*/
#define RTC_RD_DST_DAY(base)     (RTC_DST_DAY_REG(base))
#define RTC_WR_DST_DAY(base, value) (RTC_DST_DAY_REG(base) = (value))
#define RTC_RMW_DST_DAY(base, mask, value) (RTC_WR_DST_DAY(base, (RTC_RD_DST_DAY(base) & ~(mask)) | (value)))
#define RTC_SET_DST_DAY(base, value) (BME_OR16(&RTC_DST_DAY_REG(base), (uint16_t)(value)))
#define RTC_CLR_DST_DAY(base, value) (BME_AND16(&RTC_DST_DAY_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_DST_DAY(base, value) (BME_XOR16(&RTC_DST_DAY_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_DST_DAY bitfields
 */

/*!
 * @name Register RTC_DST_DAY, field DST_END_DAY[4:0] (RW)
 *
 * This is the day value for the time when DST is reversed.
 */
/*@{*/
/*! @brief Read current value of the RTC_DST_DAY_DST_END_DAY field. */
#define RTC_RD_DST_DAY_DST_END_DAY(base) ((RTC_DST_DAY_REG(base) & RTC_DST_DAY_DST_END_DAY_MASK) >> RTC_DST_DAY_DST_END_DAY_SHIFT)
#define RTC_BRD_DST_DAY_DST_END_DAY(base) (BME_UBFX16(&RTC_DST_DAY_REG(base), RTC_DST_DAY_DST_END_DAY_SHIFT, RTC_DST_DAY_DST_END_DAY_WIDTH))

/*! @brief Set the DST_END_DAY field to a new value. */
#define RTC_WR_DST_DAY_DST_END_DAY(base, value) (RTC_RMW_DST_DAY(base, RTC_DST_DAY_DST_END_DAY_MASK, RTC_DST_DAY_DST_END_DAY(value)))
#define RTC_BWR_DST_DAY_DST_END_DAY(base, value) (BME_BFI16(&RTC_DST_DAY_REG(base), ((uint16_t)(value) << RTC_DST_DAY_DST_END_DAY_SHIFT), RTC_DST_DAY_DST_END_DAY_SHIFT, RTC_DST_DAY_DST_END_DAY_WIDTH))
/*@}*/

/*!
 * @name Register RTC_DST_DAY, field DST_START_DAY[12:8] (RW)
 *
 * This is the day value for the time when DST comes into effect.
 */
/*@{*/
/*! @brief Read current value of the RTC_DST_DAY_DST_START_DAY field. */
#define RTC_RD_DST_DAY_DST_START_DAY(base) ((RTC_DST_DAY_REG(base) & RTC_DST_DAY_DST_START_DAY_MASK) >> RTC_DST_DAY_DST_START_DAY_SHIFT)
#define RTC_BRD_DST_DAY_DST_START_DAY(base) (BME_UBFX16(&RTC_DST_DAY_REG(base), RTC_DST_DAY_DST_START_DAY_SHIFT, RTC_DST_DAY_DST_START_DAY_WIDTH))

/*! @brief Set the DST_START_DAY field to a new value. */
#define RTC_WR_DST_DAY_DST_START_DAY(base, value) (RTC_RMW_DST_DAY(base, RTC_DST_DAY_DST_START_DAY_MASK, RTC_DST_DAY_DST_START_DAY(value)))
#define RTC_BWR_DST_DAY_DST_START_DAY(base, value) (BME_BFI16(&RTC_DST_DAY_REG(base), ((uint16_t)(value) << RTC_DST_DAY_DST_START_DAY_SHIFT), RTC_DST_DAY_DST_START_DAY_SHIFT, RTC_DST_DAY_DST_START_DAY_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_COMPEN - RTC Compensation Register
 ******************************************************************************/

/*!
 * @brief RTC_COMPEN - RTC Compensation Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The compensation register stores the compensation value that will be used by
 * the compensation block to correct the 1 Hz clock.
 */
/*!
 * @name Constants and macros for entire RTC_COMPEN register
 */
/*@{*/
#define RTC_RD_COMPEN(base)      (RTC_COMPEN_REG(base))
#define RTC_WR_COMPEN(base, value) (RTC_COMPEN_REG(base) = (value))
#define RTC_RMW_COMPEN(base, mask, value) (RTC_WR_COMPEN(base, (RTC_RD_COMPEN(base) & ~(mask)) | (value)))
#define RTC_SET_COMPEN(base, value) (BME_OR16(&RTC_COMPEN_REG(base), (uint16_t)(value)))
#define RTC_CLR_COMPEN(base, value) (BME_AND16(&RTC_COMPEN_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_COMPEN(base, value) (BME_XOR16(&RTC_COMPEN_REG(base), (uint16_t)(value)))
/*@}*/

