pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*******************************************************************************
 * RTC_TAMPER_DIRECTION - Tamper Direction Register
 ******************************************************************************/

/*!
 * @brief RTC_TAMPER_DIRECTION - Tamper Direction Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register defines the I/O selection of the Tamper pins and also the
 * selection between the active and passive types of tamper for each pin.
 */
/*!
 * @name Constants and macros for entire RTC_TAMPER_DIRECTION register
 */
/*@{*/
#define RTC_RD_TAMPER_DIRECTION(base) (RTC_TAMPER_DIRECTION_REG(base))
#define RTC_WR_TAMPER_DIRECTION(base, value) (RTC_TAMPER_DIRECTION_REG(base) = (value))
#define RTC_RMW_TAMPER_DIRECTION(base, mask, value) (RTC_WR_TAMPER_DIRECTION(base, (RTC_RD_TAMPER_DIRECTION(base) & ~(mask)) | (value)))
#define RTC_SET_TAMPER_DIRECTION(base, value) (BME_OR16(&RTC_TAMPER_DIRECTION_REG(base), (uint16_t)(value)))
#define RTC_CLR_TAMPER_DIRECTION(base, value) (BME_AND16(&RTC_TAMPER_DIRECTION_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_TAMPER_DIRECTION(base, value) (BME_XOR16(&RTC_TAMPER_DIRECTION_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_TAMPER_DIRECTION bitfields
 */

/*!
 * @name Register RTC_TAMPER_DIRECTION, field A_P_TAMP[3:0] (RW)
 *
 * Defines the active/passive selection of the tamper pins.
 */
/*@{*/
/*! @brief Read current value of the RTC_TAMPER_DIRECTION_A_P_TAMP field. */
#define RTC_RD_TAMPER_DIRECTION_A_P_TAMP(base) ((RTC_TAMPER_DIRECTION_REG(base) & RTC_TAMPER_DIRECTION_A_P_TAMP_MASK) >> RTC_TAMPER_DIRECTION_A_P_TAMP_SHIFT)
#define RTC_BRD_TAMPER_DIRECTION_A_P_TAMP(base) (BME_UBFX16(&RTC_TAMPER_DIRECTION_REG(base), RTC_TAMPER_DIRECTION_A_P_TAMP_SHIFT, RTC_TAMPER_DIRECTION_A_P_TAMP_WIDTH))

/*! @brief Set the A_P_TAMP field to a new value. */
#define RTC_WR_TAMPER_DIRECTION_A_P_TAMP(base, value) (RTC_RMW_TAMPER_DIRECTION(base, RTC_TAMPER_DIRECTION_A_P_TAMP_MASK, RTC_TAMPER_DIRECTION_A_P_TAMP(value)))
#define RTC_BWR_TAMPER_DIRECTION_A_P_TAMP(base, value) (BME_BFI16(&RTC_TAMPER_DIRECTION_REG(base), ((uint16_t)(value) << RTC_TAMPER_DIRECTION_A_P_TAMP_SHIFT), RTC_TAMPER_DIRECTION_A_P_TAMP_SHIFT, RTC_TAMPER_DIRECTION_A_P_TAMP_WIDTH))
/*@}*/

/*!
 * @name Register RTC_TAMPER_DIRECTION, field I_O_TAMP[11:8] (RW)
 *
 * Defines the I/O capability of tamper pins. When the corresponding A_P_TAMP
 * field, that is, bit 0 is set to passive mode, this field is only readable and
 * always reads as "0".
 */
/*@{*/
/*! @brief Read current value of the RTC_TAMPER_DIRECTION_I_O_TAMP field. */
#define RTC_RD_TAMPER_DIRECTION_I_O_TAMP(base) ((RTC_TAMPER_DIRECTION_REG(base) & RTC_TAMPER_DIRECTION_I_O_TAMP_MASK) >> RTC_TAMPER_DIRECTION_I_O_TAMP_SHIFT)
#define RTC_BRD_TAMPER_DIRECTION_I_O_TAMP(base) (BME_UBFX16(&RTC_TAMPER_DIRECTION_REG(base), RTC_TAMPER_DIRECTION_I_O_TAMP_SHIFT, RTC_TAMPER_DIRECTION_I_O_TAMP_WIDTH))

/*! @brief Set the I_O_TAMP field to a new value. */
#define RTC_WR_TAMPER_DIRECTION_I_O_TAMP(base, value) (RTC_RMW_TAMPER_DIRECTION(base, RTC_TAMPER_DIRECTION_I_O_TAMP_MASK, RTC_TAMPER_DIRECTION_I_O_TAMP(value)))
#define RTC_BWR_TAMPER_DIRECTION_I_O_TAMP(base, value) (BME_BFI16(&RTC_TAMPER_DIRECTION_REG(base), ((uint16_t)(value) << RTC_TAMPER_DIRECTION_I_O_TAMP_SHIFT), RTC_TAMPER_DIRECTION_I_O_TAMP_SHIFT, RTC_TAMPER_DIRECTION_I_O_TAMP_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_TAMPER_QSCR - Tamper Queue Status and Control Register
 ******************************************************************************/

/*!
 * @brief RTC_TAMPER_QSCR - Tamper Queue Status and Control Register (RW)
 *
 * Reset value: 0x0002U
 */
/*!
 * @name Constants and macros for entire RTC_TAMPER_QSCR register
 */
/*@{*/
#define RTC_RD_TAMPER_QSCR(base) (RTC_TAMPER_QSCR_REG(base))
#define RTC_WR_TAMPER_QSCR(base, value) (RTC_TAMPER_QSCR_REG(base) = (value))
#define RTC_RMW_TAMPER_QSCR(base, mask, value) (RTC_WR_TAMPER_QSCR(base, (RTC_RD_TAMPER_QSCR(base) & ~(mask)) | (value)))
#define RTC_SET_TAMPER_QSCR(base, value) (BME_OR16(&RTC_TAMPER_QSCR_REG(base), (uint16_t)(value)))
#define RTC_CLR_TAMPER_QSCR(base, value) (BME_AND16(&RTC_TAMPER_QSCR_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_TAMPER_QSCR(base, value) (BME_XOR16(&RTC_TAMPER_QSCR_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_TAMPER_QSCR bitfields
 */

/*!
 * @name Register RTC_TAMPER_QSCR, field Q_FULL[0] (W1C)
 *
 * Tamper Queue full status bit.
 */
/*@{*/
/*! @brief Read current value of the RTC_TAMPER_QSCR_Q_FULL field. */
#define RTC_RD_TAMPER_QSCR_Q_FULL(base) ((RTC_TAMPER_QSCR_REG(base) & RTC_TAMPER_QSCR_Q_FULL_MASK) >> RTC_TAMPER_QSCR_Q_FULL_SHIFT)
#define RTC_BRD_TAMPER_QSCR_Q_FULL(base) (BME_UBFX16(&RTC_TAMPER_QSCR_REG(base), RTC_TAMPER_QSCR_Q_FULL_SHIFT, RTC_TAMPER_QSCR_Q_FULL_WIDTH))

/*! @brief Set the Q_FULL field to a new value. */
#define RTC_WR_TAMPER_QSCR_Q_FULL(base, value) (RTC_RMW_TAMPER_QSCR(base, RTC_TAMPER_QSCR_Q_FULL_MASK, RTC_TAMPER_QSCR_Q_FULL(value)))
#define RTC_BWR_TAMPER_QSCR_Q_FULL(base, value) (BME_BFI16(&RTC_TAMPER_QSCR_REG(base), ((uint16_t)(value) << RTC_TAMPER_QSCR_Q_FULL_SHIFT), RTC_TAMPER_QSCR_Q_FULL_SHIFT, RTC_TAMPER_QSCR_Q_FULL_WIDTH))
/*@}*/

/*!
 * @name Register RTC_TAMPER_QSCR, field Q_FULL_INT_EN[1] (RW)
 *
 * Queue full interrupt enable bit.
 */
/*@{*/
/*! @brief Read current value of the RTC_TAMPER_QSCR_Q_FULL_INT_EN field. */
#define RTC_RD_TAMPER_QSCR_Q_FULL_INT_EN(base) ((RTC_TAMPER_QSCR_REG(base) & RTC_TAMPER_QSCR_Q_FULL_INT_EN_MASK) >> RTC_TAMPER_QSCR_Q_FULL_INT_EN_SHIFT)
#define RTC_BRD_TAMPER_QSCR_Q_FULL_INT_EN(base) (BME_UBFX16(&RTC_TAMPER_QSCR_REG(base), RTC_TAMPER_QSCR_Q_FULL_INT_EN_SHIFT, RTC_TAMPER_QSCR_Q_FULL_INT_EN_WIDTH))

/*! @brief Set the Q_FULL_INT_EN field to a new value. */
#define RTC_WR_TAMPER_QSCR_Q_FULL_INT_EN(base, value) (RTC_RMW_TAMPER_QSCR(base, (RTC_TAMPER_QSCR_Q_FULL_INT_EN_MASK | RTC_TAMPER_QSCR_Q_FULL_MASK), RTC_TAMPER_QSCR_Q_FULL_INT_EN(value)))
#define RTC_BWR_TAMPER_QSCR_Q_FULL_INT_EN(base, value) (BME_BFI16(&RTC_TAMPER_QSCR_REG(base), ((uint16_t)(value) << RTC_TAMPER_QSCR_Q_FULL_INT_EN_SHIFT), RTC_TAMPER_QSCR_Q_FULL_INT_EN_SHIFT, RTC_TAMPER_QSCR_Q_FULL_INT_EN_WIDTH))
/*@}*/

/*!
 * @name Register RTC_TAMPER_QSCR, field Q_CLEAR[2] (WO)
 *
 * This field when set clears the Tamper Queue. This is an auto clear bit. It
 * gets cleared in the next cycle.
 */
/*@{*/
/*! @brief Set the Q_CLEAR field to a new value. */
#define RTC_WR_TAMPER_QSCR_Q_CLEAR(base, value) (RTC_RMW_TAMPER_QSCR(base, (RTC_TAMPER_QSCR_Q_CLEAR_MASK | RTC_TAMPER_QSCR_Q_FULL_MASK), RTC_TAMPER_QSCR_Q_CLEAR(value)))
#define RTC_BWR_TAMPER_QSCR_Q_CLEAR(base, value) (RTC_WR_TAMPER_QSCR_Q_CLEAR(base, value))
/*@}*/

/*!
 * @name Register RTC_TAMPER_QSCR, field LFSR_CLK_SEL[10:8] (RW)
 *
 * This field defines the clock selection for LFSR module. This value should be
 * the same for all the active tamper filter clock selects (defined for the input
 * pin). LFSR is only enabled if user defines atleast one of the tamper pins as
 * ACTIVE.
 */
/*@{*/
/*! @brief Read current value of the RTC_TAMPER_QSCR_LFSR_CLK_SEL field. */
#define RTC_RD_TAMPER_QSCR_LFSR_CLK_SEL(base) ((RTC_TAMPER_QSCR_REG(base) & RTC_TAMPER_QSCR_LFSR_CLK_SEL_MASK) >> RTC_TAMPER_QSCR_LFSR_CLK_SEL_SHIFT)
#define RTC_BRD_TAMPER_QSCR_LFSR_CLK_SEL(base) (BME_UBFX16(&RTC_TAMPER_QSCR_REG(base), RTC_TAMPER_QSCR_LFSR_CLK_SEL_SHIFT, RTC_TAMPER_QSCR_LFSR_CLK_SEL_WIDTH))

/*! @brief Set the LFSR_CLK_SEL field to a new value. */
#define RTC_WR_TAMPER_QSCR_LFSR_CLK_SEL(base, value) (RTC_RMW_TAMPER_QSCR(base, (RTC_TAMPER_QSCR_LFSR_CLK_SEL_MASK | RTC_TAMPER_QSCR_Q_FULL_MASK), RTC_TAMPER_QSCR_LFSR_CLK_SEL(value)))
#define RTC_BWR_TAMPER_QSCR_LFSR_CLK_SEL(base, value) (BME_BFI16(&RTC_TAMPER_QSCR_REG(base), ((uint16_t)(value) << RTC_TAMPER_QSCR_LFSR_CLK_SEL_SHIFT), RTC_TAMPER_QSCR_LFSR_CLK_SEL_SHIFT, RTC_TAMPER_QSCR_LFSR_CLK_SEL_WIDTH))
/*@}*/

/*!
 * @name Register RTC_TAMPER_QSCR, field LFSR_DURATION[15:12] (RW)
 *
 * LFSR Filter duration period:- Denotes the LFSR clocks after which the LFSR
 * shifts its value. This value should be the same value used for all the Active
 * tamper filter duration period (defined for the input pin).
 */
/*@{*/
/*! @brief Read current value of the RTC_TAMPER_QSCR_LFSR_DURATION field. */
#define RTC_RD_TAMPER_QSCR_LFSR_DURATION(base) ((RTC_TAMPER_QSCR_REG(base) & RTC_TAMPER_QSCR_LFSR_DURATION_MASK) >> RTC_TAMPER_QSCR_LFSR_DURATION_SHIFT)
#define RTC_BRD_TAMPER_QSCR_LFSR_DURATION(base) (BME_UBFX16(&RTC_TAMPER_QSCR_REG(base), RTC_TAMPER_QSCR_LFSR_DURATION_SHIFT, RTC_TAMPER_QSCR_LFSR_DURATION_WIDTH))

/*! @brief Set the LFSR_DURATION field to a new value. */
#define RTC_WR_TAMPER_QSCR_LFSR_DURATION(base, value) (RTC_RMW_TAMPER_QSCR(base, (RTC_TAMPER_QSCR_LFSR_DURATION_MASK | RTC_TAMPER_QSCR_Q_FULL_MASK), RTC_TAMPER_QSCR_LFSR_DURATION(value)))
#define RTC_BWR_TAMPER_QSCR_LFSR_DURATION(base, value) (BME_BFI16(&RTC_TAMPER_QSCR_REG(base), ((uint16_t)(value) << RTC_TAMPER_QSCR_LFSR_DURATION_SHIFT), RTC_TAMPER_QSCR_LFSR_DURATION_SHIFT, RTC_TAMPER_QSCR_LFSR_DURATION_WIDTH))
/*@}*/

