pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*! @brief Set the XBAR field to a new value. */
#define SIM_WR_SCGC5_XBAR(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_XBAR_MASK, SIM_SCGC5_XBAR(value)))
#define SIM_BWR_SCGC5_XBAR(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_XBAR_SHIFT), SIM_SCGC5_XBAR_SHIFT, SIM_SCGC5_XBAR_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field TMR0[23] (RW)
 *
 * This bit controls the clock gate to the QTMR0
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_TMR0 field. */
#define SIM_RD_SCGC5_TMR0(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_TMR0_MASK) >> SIM_SCGC5_TMR0_SHIFT)
#define SIM_BRD_SCGC5_TMR0(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_TMR0_SHIFT, SIM_SCGC5_TMR0_WIDTH))

/*! @brief Set the TMR0 field to a new value. */
#define SIM_WR_SCGC5_TMR0(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_TMR0_MASK, SIM_SCGC5_TMR0(value)))
#define SIM_BWR_SCGC5_TMR0(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_TMR0_SHIFT), SIM_SCGC5_TMR0_SHIFT, SIM_SCGC5_TMR0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field TMR1[24] (RW)
 *
 * This bit controls the clock gate to the QTMR1
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_TMR1 field. */
#define SIM_RD_SCGC5_TMR1(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_TMR1_MASK) >> SIM_SCGC5_TMR1_SHIFT)
#define SIM_BRD_SCGC5_TMR1(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_TMR1_SHIFT, SIM_SCGC5_TMR1_WIDTH))

/*! @brief Set the TMR1 field to a new value. */
#define SIM_WR_SCGC5_TMR1(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_TMR1_MASK, SIM_SCGC5_TMR1(value)))
#define SIM_BWR_SCGC5_TMR1(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_TMR1_SHIFT), SIM_SCGC5_TMR1_SHIFT, SIM_SCGC5_TMR1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field TMR2[25] (RW)
 *
 * This bit controls the clock gate to the QTMR2
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_TMR2 field. */
#define SIM_RD_SCGC5_TMR2(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_TMR2_MASK) >> SIM_SCGC5_TMR2_SHIFT)
#define SIM_BRD_SCGC5_TMR2(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_TMR2_SHIFT, SIM_SCGC5_TMR2_WIDTH))

/*! @brief Set the TMR2 field to a new value. */
#define SIM_WR_SCGC5_TMR2(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_TMR2_MASK, SIM_SCGC5_TMR2(value)))
#define SIM_BWR_SCGC5_TMR2(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_TMR2_SHIFT), SIM_SCGC5_TMR2_SHIFT, SIM_SCGC5_TMR2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field TMR3[26] (RW)
 *
 * This bit controls the clock gate to the QTMR3
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_TMR3 field. */
#define SIM_RD_SCGC5_TMR3(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_TMR3_MASK) >> SIM_SCGC5_TMR3_SHIFT)
#define SIM_BRD_SCGC5_TMR3(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_TMR3_SHIFT, SIM_SCGC5_TMR3_WIDTH))

/*! @brief Set the TMR3 field to a new value. */
#define SIM_WR_SCGC5_TMR3(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_TMR3_MASK, SIM_SCGC5_TMR3(value)))
#define SIM_BWR_SCGC5_TMR3(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_TMR3_SHIFT), SIM_SCGC5_TMR3_SHIFT, SIM_SCGC5_TMR3_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SCGC6 - System Clock Gating Control Register 6
 ******************************************************************************/

/*!
 * @brief SIM_SCGC6 - System Clock Gating Control Register 6 (RW)
 *
 * Reset value: 0xC0000001U
 *
 * Writes to this register can only be performed in Supervisor mode
 */
/*!
 * @name Constants and macros for entire SIM_SCGC6 register
 */
/*@{*/
#define SIM_RD_SCGC6(base)       (SIM_SCGC6_REG(base))
#define SIM_WR_SCGC6(base, value) (SIM_SCGC6_REG(base) = (value))
#define SIM_RMW_SCGC6(base, mask, value) (SIM_WR_SCGC6(base, (SIM_RD_SCGC6(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC6(base, value) (BME_OR32(&SIM_SCGC6_REG(base), (uint32_t)(value)))
#define SIM_CLR_SCGC6(base, value) (BME_AND32(&SIM_SCGC6_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SCGC6(base, value) (BME_XOR32(&SIM_SCGC6_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC6 bitfields
 */

/*!
 * @name Register SIM_SCGC6, field FTFA[0] (RW)
 *
 * This bit controls the clock gate to the FTFA Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_FTFA field. */
#define SIM_RD_SCGC6_FTFA(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_FTFA_MASK) >> SIM_SCGC6_FTFA_SHIFT)
#define SIM_BRD_SCGC6_FTFA(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_FTFA_SHIFT, SIM_SCGC6_FTFA_WIDTH))

/*! @brief Set the FTFA field to a new value. */
#define SIM_WR_SCGC6_FTFA(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_FTFA_MASK, SIM_SCGC6_FTFA(value)))
#define SIM_BWR_SCGC6_FTFA(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_FTFA_SHIFT), SIM_SCGC6_FTFA_SHIFT, SIM_SCGC6_FTFA_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field DMAMUX0[1] (RW)
 *
 * This bit controls the clock gate to the DMA MUX0 Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_DMAMUX0 field. */
#define SIM_RD_SCGC6_DMAMUX0(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_DMAMUX0_MASK) >> SIM_SCGC6_DMAMUX0_SHIFT)
#define SIM_BRD_SCGC6_DMAMUX0(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_DMAMUX0_SHIFT, SIM_SCGC6_DMAMUX0_WIDTH))

/*! @brief Set the DMAMUX0 field to a new value. */
#define SIM_WR_SCGC6_DMAMUX0(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_DMAMUX0_MASK, SIM_SCGC6_DMAMUX0(value)))
#define SIM_BWR_SCGC6_DMAMUX0(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_DMAMUX0_SHIFT), SIM_SCGC6_DMAMUX0_SHIFT, SIM_SCGC6_DMAMUX0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field DMAMUX1[2] (RW)
 *
 * This bit controls the clock gate to the DMA MUX1 Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_DMAMUX1 field. */
#define SIM_RD_SCGC6_DMAMUX1(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_DMAMUX1_MASK) >> SIM_SCGC6_DMAMUX1_SHIFT)
#define SIM_BRD_SCGC6_DMAMUX1(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_DMAMUX1_SHIFT, SIM_SCGC6_DMAMUX1_WIDTH))

/*! @brief Set the DMAMUX1 field to a new value. */
#define SIM_WR_SCGC6_DMAMUX1(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_DMAMUX1_MASK, SIM_SCGC6_DMAMUX1(value)))
#define SIM_BWR_SCGC6_DMAMUX1(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_DMAMUX1_SHIFT), SIM_SCGC6_DMAMUX1_SHIFT, SIM_SCGC6_DMAMUX1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field DMAMUX2[3] (RW)
 *
 * This bit controls the clock gate to the DMA MUX2 Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_DMAMUX2 field. */
#define SIM_RD_SCGC6_DMAMUX2(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_DMAMUX2_MASK) >> SIM_SCGC6_DMAMUX2_SHIFT)
#define SIM_BRD_SCGC6_DMAMUX2(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_DMAMUX2_SHIFT, SIM_SCGC6_DMAMUX2_WIDTH))

/*! @brief Set the DMAMUX2 field to a new value. */
#define SIM_WR_SCGC6_DMAMUX2(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_DMAMUX2_MASK, SIM_SCGC6_DMAMUX2(value)))
#define SIM_BWR_SCGC6_DMAMUX2(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_DMAMUX2_SHIFT), SIM_SCGC6_DMAMUX2_SHIFT, SIM_SCGC6_DMAMUX2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field DMAMUX3[4] (RW)
 *
 * This bit controls the clock gate to the DMA MUX3 Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_DMAMUX3 field. */
#define SIM_RD_SCGC6_DMAMUX3(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_DMAMUX3_MASK) >> SIM_SCGC6_DMAMUX3_SHIFT)
#define SIM_BRD_SCGC6_DMAMUX3(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_DMAMUX3_SHIFT, SIM_SCGC6_DMAMUX3_WIDTH))

/*! @brief Set the DMAMUX3 field to a new value. */
#define SIM_WR_SCGC6_DMAMUX3(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_DMAMUX3_MASK, SIM_SCGC6_DMAMUX3(value)))
#define SIM_BWR_SCGC6_DMAMUX3(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_DMAMUX3_SHIFT), SIM_SCGC6_DMAMUX3_SHIFT, SIM_SCGC6_DMAMUX3_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field RNGA[9] (RW)
 *
 * This bit controls the clock gate to the RNGA Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_RNGA field. */
#define SIM_RD_SCGC6_RNGA(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_RNGA_MASK) >> SIM_SCGC6_RNGA_SHIFT)
#define SIM_BRD_SCGC6_RNGA(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_RNGA_SHIFT, SIM_SCGC6_RNGA_WIDTH))

/*! @brief Set the RNGA field to a new value. */
#define SIM_WR_SCGC6_RNGA(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_RNGA_MASK, SIM_SCGC6_RNGA(value)))
#define SIM_BWR_SCGC6_RNGA(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_RNGA_SHIFT), SIM_SCGC6_RNGA_SHIFT, SIM_SCGC6_RNGA_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field ADC[11] (RW)
 *
 * This bit controls the clock gate to the SAR ADC Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_ADC field. */
#define SIM_RD_SCGC6_ADC(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_ADC_MASK) >> SIM_SCGC6_ADC_SHIFT)
#define SIM_BRD_SCGC6_ADC(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_ADC_SHIFT, SIM_SCGC6_ADC_WIDTH))

/*! @brief Set the ADC field to a new value. */
#define SIM_WR_SCGC6_ADC(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_ADC_MASK, SIM_SCGC6_ADC(value)))
#define SIM_BWR_SCGC6_ADC(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_ADC_SHIFT), SIM_SCGC6_ADC_SHIFT, SIM_SCGC6_ADC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field PIT0[13] (RW)
 *
 * This bit controls the clock gate to the PIT0 Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_PIT0 field. */
#define SIM_RD_SCGC6_PIT0(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_PIT0_MASK) >> SIM_SCGC6_PIT0_SHIFT)
#define SIM_BRD_SCGC6_PIT0(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_PIT0_SHIFT, SIM_SCGC6_PIT0_WIDTH))

/*! @brief Set the PIT0 field to a new value. */
#define SIM_WR_SCGC6_PIT0(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_PIT0_MASK, SIM_SCGC6_PIT0(value)))
#define SIM_BWR_SCGC6_PIT0(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_PIT0_SHIFT), SIM_SCGC6_PIT0_SHIFT, SIM_SCGC6_PIT0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field PIT1[14] (RW)
 *
 * This bit controls the clock gate to the PIT1 Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_PIT1 field. */
#define SIM_RD_SCGC6_PIT1(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_PIT1_MASK) >> SIM_SCGC6_PIT1_SHIFT)
#define SIM_BRD_SCGC6_PIT1(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_PIT1_SHIFT, SIM_SCGC6_PIT1_WIDTH))

/*! @brief Set the PIT1 field to a new value. */
#define SIM_WR_SCGC6_PIT1(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_PIT1_MASK, SIM_SCGC6_PIT1(value)))
#define SIM_BWR_SCGC6_PIT1(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_PIT1_SHIFT), SIM_SCGC6_PIT1_SHIFT, SIM_SCGC6_PIT1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field AFE[16] (RW)
 *
 * This bit controls the clock to all four AFE channels.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_AFE field. */
#define SIM_RD_SCGC6_AFE(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_AFE_MASK) >> SIM_SCGC6_AFE_SHIFT)
#define SIM_BRD_SCGC6_AFE(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_AFE_SHIFT, SIM_SCGC6_AFE_WIDTH))

/*! @brief Set the AFE field to a new value. */
#define SIM_WR_SCGC6_AFE(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_AFE_MASK, SIM_SCGC6_AFE(value)))
#define SIM_BWR_SCGC6_AFE(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_AFE_SHIFT), SIM_SCGC6_AFE_SHIFT, SIM_SCGC6_AFE_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field CRC[20] (RW)
 *
 * This bit controls the clock gate to the PCRC Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_CRC field. */
#define SIM_RD_SCGC6_CRC(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_CRC_MASK) >> SIM_SCGC6_CRC_SHIFT)
#define SIM_BRD_SCGC6_CRC(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_CRC_SHIFT, SIM_SCGC6_CRC_WIDTH))

/*! @brief Set the CRC field to a new value. */
#define SIM_WR_SCGC6_CRC(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_CRC_MASK, SIM_SCGC6_CRC(value)))
#define SIM_BWR_SCGC6_CRC(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_CRC_SHIFT), SIM_SCGC6_CRC_SHIFT, SIM_SCGC6_CRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field LPTMR[28] (RW)
 *
 * This bit controls the clock gate to the LPTMR Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_LPTMR field. */
#define SIM_RD_SCGC6_LPTMR(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_LPTMR_MASK) >> SIM_SCGC6_LPTMR_SHIFT)
#define SIM_BRD_SCGC6_LPTMR(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_LPTMR_SHIFT, SIM_SCGC6_LPTMR_WIDTH))

/*! @brief Set the LPTMR field to a new value. */
#define SIM_WR_SCGC6_LPTMR(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_LPTMR_MASK, SIM_SCGC6_LPTMR(value)))
#define SIM_BWR_SCGC6_LPTMR(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_LPTMR_SHIFT), SIM_SCGC6_LPTMR_SHIFT, SIM_SCGC6_LPTMR_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field SIM_LP[30] (RW)
 *
 * This bit controls the clock gate to the SIM Low Power logic.
 *
 * Values:
 * - 1 - Clock is enabled
 * - 0 - Clock is disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_SIM_LP field. */
#define SIM_RD_SCGC6_SIM_LP(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_SIM_LP_MASK) >> SIM_SCGC6_SIM_LP_SHIFT)
#define SIM_BRD_SCGC6_SIM_LP(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_SIM_LP_SHIFT, SIM_SCGC6_SIM_LP_WIDTH))

/*! @brief Set the SIM_LP field to a new value. */
#define SIM_WR_SCGC6_SIM_LP(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_SIM_LP_MASK, SIM_SCGC6_SIM_LP(value)))
#define SIM_BWR_SCGC6_SIM_LP(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_SIM_LP_SHIFT), SIM_SCGC6_SIM_LP_SHIFT, SIM_SCGC6_SIM_LP_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field SIM_HP[31] (RO)
 *
 * This bit controls the clock gate to the SIM High Power Logic.
 *
 * Values:
 * - 1 - Clock is always enabled to SIM
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_SIM_HP field. */
#define SIM_RD_SCGC6_SIM_HP(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_SIM_HP_MASK) >> SIM_SCGC6_SIM_HP_SHIFT)
#define SIM_BRD_SCGC6_SIM_HP(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_SIM_HP_SHIFT, SIM_SCGC6_SIM_HP_WIDTH))
/*@}*/

