pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*******************************************************************************
 * SIM_SCGC7 - System Clock Gating Control Register 7
 ******************************************************************************/

/*!
 * @brief SIM_SCGC7 - System Clock Gating Control Register 7 (RW)
 *
 * Reset value: 0x00000003U
 *
 * Writes to this register can only be performed in Supervisor mode
 */
/*!
 * @name Constants and macros for entire SIM_SCGC7 register
 */
/*@{*/
#define SIM_RD_SCGC7(base)       (SIM_SCGC7_REG(base))
#define SIM_WR_SCGC7(base, value) (SIM_SCGC7_REG(base) = (value))
#define SIM_RMW_SCGC7(base, mask, value) (SIM_WR_SCGC7(base, (SIM_RD_SCGC7(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC7(base, value) (BME_OR32(&SIM_SCGC7_REG(base), (uint32_t)(value)))
#define SIM_CLR_SCGC7(base, value) (BME_AND32(&SIM_SCGC7_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SCGC7(base, value) (BME_XOR32(&SIM_SCGC7_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC7 bitfields
 */

/*!
 * @name Register SIM_SCGC7, field MPU[0] (RW)
 *
 * This bit controls the clock gate to the MPU module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC7_MPU field. */
#define SIM_RD_SCGC7_MPU(base) ((SIM_SCGC7_REG(base) & SIM_SCGC7_MPU_MASK) >> SIM_SCGC7_MPU_SHIFT)
#define SIM_BRD_SCGC7_MPU(base) (BME_UBFX32(&SIM_SCGC7_REG(base), SIM_SCGC7_MPU_SHIFT, SIM_SCGC7_MPU_WIDTH))

/*! @brief Set the MPU field to a new value. */
#define SIM_WR_SCGC7_MPU(base, value) (SIM_RMW_SCGC7(base, SIM_SCGC7_MPU_MASK, SIM_SCGC7_MPU(value)))
#define SIM_BWR_SCGC7_MPU(base, value) (BME_BFI32(&SIM_SCGC7_REG(base), ((uint32_t)(value) << SIM_SCGC7_MPU_SHIFT), SIM_SCGC7_MPU_SHIFT, SIM_SCGC7_MPU_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC7, field DMA[1] (RW)
 *
 * This bit controls the clock gate to the DMA module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC7_DMA field. */
#define SIM_RD_SCGC7_DMA(base) ((SIM_SCGC7_REG(base) & SIM_SCGC7_DMA_MASK) >> SIM_SCGC7_DMA_SHIFT)
#define SIM_BRD_SCGC7_DMA(base) (BME_UBFX32(&SIM_SCGC7_REG(base), SIM_SCGC7_DMA_SHIFT, SIM_SCGC7_DMA_WIDTH))

/*! @brief Set the DMA field to a new value. */
#define SIM_WR_SCGC7_DMA(base, value) (SIM_RMW_SCGC7(base, SIM_SCGC7_DMA_MASK, SIM_SCGC7_DMA(value)))
#define SIM_BWR_SCGC7_DMA(base, value) (BME_BFI32(&SIM_SCGC7_REG(base), ((uint32_t)(value) << SIM_SCGC7_DMA_SHIFT), SIM_SCGC7_DMA_SHIFT, SIM_SCGC7_DMA_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_CLKDIV1 - System Clock Divider Register 1
 ******************************************************************************/

/*!
 * @brief SIM_CLKDIV1 - System Clock Divider Register 1 (RW)
 *
 * Reset value: 0x08000000U
 *
 * Writes to this register can only be performed in Supervisor mode
 */
/*!
 * @name Constants and macros for entire SIM_CLKDIV1 register
 */
/*@{*/
#define SIM_RD_CLKDIV1(base)     (SIM_CLKDIV1_REG(base))
#define SIM_WR_CLKDIV1(base, value) (SIM_CLKDIV1_REG(base) = (value))
#define SIM_RMW_CLKDIV1(base, mask, value) (SIM_WR_CLKDIV1(base, (SIM_RD_CLKDIV1(base) & ~(mask)) | (value)))
#define SIM_SET_CLKDIV1(base, value) (BME_OR32(&SIM_CLKDIV1_REG(base), (uint32_t)(value)))
#define SIM_CLR_CLKDIV1(base, value) (BME_AND32(&SIM_CLKDIV1_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_CLKDIV1(base, value) (BME_XOR32(&SIM_CLKDIV1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_CLKDIV1 bitfields
 */

/*!
 * @name Register SIM_CLKDIV1, field SYSCLKMODE[27] (RW)
 *
 * This field is used to select the System clock : Bus clock : Flash clock ratio.
 *
 * Values:
 * - 0 - 1:1:1
 * - 1 - 2:1:1
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV1_SYSCLKMODE field. */
#define SIM_RD_CLKDIV1_SYSCLKMODE(base) ((SIM_CLKDIV1_REG(base) & SIM_CLKDIV1_SYSCLKMODE_MASK) >> SIM_CLKDIV1_SYSCLKMODE_SHIFT)
#define SIM_BRD_CLKDIV1_SYSCLKMODE(base) (BME_UBFX32(&SIM_CLKDIV1_REG(base), SIM_CLKDIV1_SYSCLKMODE_SHIFT, SIM_CLKDIV1_SYSCLKMODE_WIDTH))

/*! @brief Set the SYSCLKMODE field to a new value. */
#define SIM_WR_CLKDIV1_SYSCLKMODE(base, value) (SIM_RMW_CLKDIV1(base, SIM_CLKDIV1_SYSCLKMODE_MASK, SIM_CLKDIV1_SYSCLKMODE(value)))
#define SIM_BWR_CLKDIV1_SYSCLKMODE(base, value) (BME_BFI32(&SIM_CLKDIV1_REG(base), ((uint32_t)(value) << SIM_CLKDIV1_SYSCLKMODE_SHIFT), SIM_CLKDIV1_SYSCLKMODE_SHIFT, SIM_CLKDIV1_SYSCLKMODE_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CLKDIV1, field SYSDIV[31:28] (RW)
 *
 * This field can be used to program Core/Platform divider.
 *
 * Values:
 * - 0000 - Divide by 1
 * - 0001 - Divide by 2
 * - 0010 - Divide by 3
 * - 0011 - Divide by 4 and so on..... If FOPT[0] is 0, the divider is set to
 *     div-by-8 after system reset is deasserted (after completion of system
 *     initialization sequence)
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV1_SYSDIV field. */
#define SIM_RD_CLKDIV1_SYSDIV(base) ((SIM_CLKDIV1_REG(base) & SIM_CLKDIV1_SYSDIV_MASK) >> SIM_CLKDIV1_SYSDIV_SHIFT)
#define SIM_BRD_CLKDIV1_SYSDIV(base) (BME_UBFX32(&SIM_CLKDIV1_REG(base), SIM_CLKDIV1_SYSDIV_SHIFT, SIM_CLKDIV1_SYSDIV_WIDTH))

/*! @brief Set the SYSDIV field to a new value. */
#define SIM_WR_CLKDIV1_SYSDIV(base, value) (SIM_RMW_CLKDIV1(base, SIM_CLKDIV1_SYSDIV_MASK, SIM_CLKDIV1_SYSDIV(value)))
#define SIM_BWR_CLKDIV1_SYSDIV(base, value) (BME_BFI32(&SIM_CLKDIV1_REG(base), ((uint32_t)(value) << SIM_CLKDIV1_SYSDIV_SHIFT), SIM_CLKDIV1_SYSDIV_SHIFT, SIM_CLKDIV1_SYSDIV_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_FCFG1 - Flash Configuration Register 1
 ******************************************************************************/

/*!
 * @brief SIM_FCFG1 - Flash Configuration Register 1 (RW)
 *
 * Reset value: 0x07000000U
 *
 * Writes to this register can only be performed in Supervisor mode
 */
/*!
 * @name Constants and macros for entire SIM_FCFG1 register
 */
/*@{*/
#define SIM_RD_FCFG1(base)       (SIM_FCFG1_REG(base))
#define SIM_WR_FCFG1(base, value) (SIM_FCFG1_REG(base) = (value))
#define SIM_RMW_FCFG1(base, mask, value) (SIM_WR_FCFG1(base, (SIM_RD_FCFG1(base) & ~(mask)) | (value)))
#define SIM_SET_FCFG1(base, value) (BME_OR32(&SIM_FCFG1_REG(base), (uint32_t)(value)))
#define SIM_CLR_FCFG1(base, value) (BME_AND32(&SIM_FCFG1_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_FCFG1(base, value) (BME_XOR32(&SIM_FCFG1_REG(base), (uint32_t)(value)))
/*@}*/

