pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*! @brief Set the UART0IRSEL field to a new value. */
#define SIM_WR_MISC_CTL_UART0IRSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_UART0IRSEL_MASK, SIM_MISC_CTL_UART0IRSEL(value)))
#define SIM_BWR_MISC_CTL_UART0IRSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_UART0IRSEL_SHIFT), SIM_MISC_CTL_UART0IRSEL_SHIFT, SIM_MISC_CTL_UART0IRSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field UART1IRSEL[9] (RW)
 *
 * Exclusive selection with other UARTs. Do not select while another UART is
 * selected for the same functionality
 *
 * Values:
 * - 0 - Pad RX input (PTD[2] or PTI[0], as selected in Pinmux control) selected
 *     for RX input of UART1 and UART1 TX signal is not used for modulation
 * - 1 - UART1 selected for IRDA modulation. UART1 TX modulated by XBAR_OUT[14]
 *     and UART1 RX input connected to XBAR_OUT[13]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_UART1IRSEL field. */
#define SIM_RD_MISC_CTL_UART1IRSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_UART1IRSEL_MASK) >> SIM_MISC_CTL_UART1IRSEL_SHIFT)
#define SIM_BRD_MISC_CTL_UART1IRSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_UART1IRSEL_SHIFT, SIM_MISC_CTL_UART1IRSEL_WIDTH))

/*! @brief Set the UART1IRSEL field to a new value. */
#define SIM_WR_MISC_CTL_UART1IRSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_UART1IRSEL_MASK, SIM_MISC_CTL_UART1IRSEL(value)))
#define SIM_BWR_MISC_CTL_UART1IRSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_UART1IRSEL_SHIFT), SIM_MISC_CTL_UART1IRSEL_SHIFT, SIM_MISC_CTL_UART1IRSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field UART2IRSEL[10] (RW)
 *
 * Exclusive selection with other UARTs. Do not select while another UART is
 * selected for the same functionality
 *
 * Values:
 * - 0 - Pad RX input PTE[6] selected for RX input of UART2 and UART2 TX signal
 *     is not used for modulation
 * - 1 - UART2 selected for IRDA modulation. UART2 TX modulated by XBAR_OUT[14]
 *     and UART2 RX input connected to XBAR_OUT[13].
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_UART2IRSEL field. */
#define SIM_RD_MISC_CTL_UART2IRSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_UART2IRSEL_MASK) >> SIM_MISC_CTL_UART2IRSEL_SHIFT)
#define SIM_BRD_MISC_CTL_UART2IRSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_UART2IRSEL_SHIFT, SIM_MISC_CTL_UART2IRSEL_WIDTH))

/*! @brief Set the UART2IRSEL field to a new value. */
#define SIM_WR_MISC_CTL_UART2IRSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_UART2IRSEL_MASK, SIM_MISC_CTL_UART2IRSEL(value)))
#define SIM_BWR_MISC_CTL_UART2IRSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_UART2IRSEL_SHIFT), SIM_MISC_CTL_UART2IRSEL_SHIFT, SIM_MISC_CTL_UART2IRSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field UART3IRSEL[11] (RW)
 *
 * Exclusive selection with other UARTs. Do not select while another UART is
 * selected for the same functionality
 *
 * Values:
 * - 0 - Pad RX input (PTC[3] or PTD[7], as selected in Pinmux control) selected
 *     for RX input of UART3 and UART3 TX signal is not used for modulation
 * - 1 - UART3 selected for IRDA modulation. UART3 TX modulated by XBAR_OUT[14]
 *     and UART3 RX input connected to XBAR_OUT[13].
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_UART3IRSEL field. */
#define SIM_RD_MISC_CTL_UART3IRSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_UART3IRSEL_MASK) >> SIM_MISC_CTL_UART3IRSEL_SHIFT)
#define SIM_BRD_MISC_CTL_UART3IRSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_UART3IRSEL_SHIFT, SIM_MISC_CTL_UART3IRSEL_WIDTH))

/*! @brief Set the UART3IRSEL field to a new value. */
#define SIM_WR_MISC_CTL_UART3IRSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_UART3IRSEL_MASK, SIM_MISC_CTL_UART3IRSEL(value)))
#define SIM_BWR_MISC_CTL_UART3IRSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_UART3IRSEL_SHIFT), SIM_MISC_CTL_UART3IRSEL_SHIFT, SIM_MISC_CTL_UART3IRSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field XBARPITOUTSEL[13:12] (RW)
 *
 * This field selects PIT timer and timer channel to drive XBAR_IN[16].
 *
 * Values:
 * - 00 - PIT0[0] (default)
 * - 01 - PIT0[1]
 * - 10 - PIT1[0]
 * - 11 - PIT1[1]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_XBARPITOUTSEL field. */
#define SIM_RD_MISC_CTL_XBARPITOUTSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_XBARPITOUTSEL_MASK) >> SIM_MISC_CTL_XBARPITOUTSEL_SHIFT)
#define SIM_BRD_MISC_CTL_XBARPITOUTSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_XBARPITOUTSEL_SHIFT, SIM_MISC_CTL_XBARPITOUTSEL_WIDTH))

/*! @brief Set the XBARPITOUTSEL field to a new value. */
#define SIM_WR_MISC_CTL_XBARPITOUTSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_XBARPITOUTSEL_MASK, SIM_MISC_CTL_XBARPITOUTSEL(value)))
#define SIM_BWR_MISC_CTL_XBARPITOUTSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_XBARPITOUTSEL_SHIFT), SIM_MISC_CTL_XBARPITOUTSEL_SHIFT, SIM_MISC_CTL_XBARPITOUTSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field EWMINSEL[14] (RW)
 *
 * This field is used to select input for external watchdog monitor.
 *
 * Values:
 * - 0 - Input from PAD (PTE[2] or PTE[4] as selected from Pinmux control )
 * - 1 - Peripheral Crossbar (XBAR) Output[32]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_EWMINSEL field. */
#define SIM_RD_MISC_CTL_EWMINSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_EWMINSEL_MASK) >> SIM_MISC_CTL_EWMINSEL_SHIFT)
#define SIM_BRD_MISC_CTL_EWMINSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_EWMINSEL_SHIFT, SIM_MISC_CTL_EWMINSEL_WIDTH))

/*! @brief Set the EWMINSEL field to a new value. */
#define SIM_WR_MISC_CTL_EWMINSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_EWMINSEL_MASK, SIM_MISC_CTL_EWMINSEL(value)))
#define SIM_BWR_MISC_CTL_EWMINSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_EWMINSEL_SHIFT), SIM_MISC_CTL_EWMINSEL_SHIFT, SIM_MISC_CTL_EWMINSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR0PLLCLKSEL[15] (RW)
 *
 * Values:
 * - 0 - Selects Bus Clock as source for the Timer CH0
 * - 1 - Selects the PLL_AFE clock as the source for Timer CH0. The PLL_AFE
 *     clock source is itself selected using the MISC_CTL[5:4]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR0PLLCLKSEL field. */
#define SIM_RD_MISC_CTL_TMR0PLLCLKSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR0PLLCLKSEL_MASK) >> SIM_MISC_CTL_TMR0PLLCLKSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR0PLLCLKSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR0PLLCLKSEL_SHIFT, SIM_MISC_CTL_TMR0PLLCLKSEL_WIDTH))

/*! @brief Set the TMR0PLLCLKSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR0PLLCLKSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR0PLLCLKSEL_MASK, SIM_MISC_CTL_TMR0PLLCLKSEL(value)))
#define SIM_BWR_MISC_CTL_TMR0PLLCLKSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR0PLLCLKSEL_SHIFT), SIM_MISC_CTL_TMR0PLLCLKSEL_SHIFT, SIM_MISC_CTL_TMR0PLLCLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR0SCSSEL[16] (RW)
 *
 * This field is used to select secondary count input source for Quadtimer
 * Channel0. Configure TMR_0_CTRL_SCS = 00b to route selected secondary source to the
 * timer Channel0.
 *
 * Values:
 * - 0 - Pad PTF1 or PTD5, depending upon PCTL configuration.
 * - 1 - Peripheral Crossbar (XBAR) Output[5]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR0SCSSEL field. */
#define SIM_RD_MISC_CTL_TMR0SCSSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR0SCSSEL_MASK) >> SIM_MISC_CTL_TMR0SCSSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR0SCSSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR0SCSSEL_SHIFT, SIM_MISC_CTL_TMR0SCSSEL_WIDTH))

