pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*******************************************************************************
 * TMR_CTRL - Timer Channel Control Register
 ******************************************************************************/

/*!
 * @brief TMR_CTRL - Timer Channel Control Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_CTRL register
 */
/*@{*/
#define TMR_RD_CTRL(base)        (TMR_CTRL_REG(base))
#define TMR_WR_CTRL(base, value) (TMR_CTRL_REG(base) = (value))
#define TMR_RMW_CTRL(base, mask, value) (TMR_WR_CTRL(base, (TMR_RD_CTRL(base) & ~(mask)) | (value)))
#define TMR_SET_CTRL(base, value) (BME_OR16(&TMR_CTRL_REG(base), (uint16_t)(value)))
#define TMR_CLR_CTRL(base, value) (BME_AND16(&TMR_CTRL_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_CTRL(base, value) (BME_XOR16(&TMR_CTRL_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TMR_CTRL bitfields
 */

/*!
 * @name Register TMR_CTRL, field OUTMODE[2:0] (RW)
 *
 * These bits determine the mode of operation for the OFLAG output signal.
 *
 * Values:
 * - 000 - Asserted while counter is active
 * - 001 - Clear OFLAG output on successful compare
 * - 010 - Set OFLAG output on successful compare
 * - 011 - Toggle OFLAG output on successful compare
 * - 100 - Toggle OFLAG output using alternating compare registers
 * - 101 - Set on compare, cleared on secondary source input edge
 * - 110 - Set on compare, cleared on counter rollover
 * - 111 - Enable gated clock output while counter is active
 */
/*@{*/
/*! @brief Read current value of the TMR_CTRL_OUTMODE field. */
#define TMR_RD_CTRL_OUTMODE(base) ((TMR_CTRL_REG(base) & TMR_CTRL_OUTMODE_MASK) >> TMR_CTRL_OUTMODE_SHIFT)
#define TMR_BRD_CTRL_OUTMODE(base) (BME_UBFX16(&TMR_CTRL_REG(base), TMR_CTRL_OUTMODE_SHIFT, TMR_CTRL_OUTMODE_WIDTH))

/*! @brief Set the OUTMODE field to a new value. */
#define TMR_WR_CTRL_OUTMODE(base, value) (TMR_RMW_CTRL(base, TMR_CTRL_OUTMODE_MASK, TMR_CTRL_OUTMODE(value)))
#define TMR_BWR_CTRL_OUTMODE(base, value) (BME_BFI16(&TMR_CTRL_REG(base), ((uint16_t)(value) << TMR_CTRL_OUTMODE_SHIFT), TMR_CTRL_OUTMODE_SHIFT, TMR_CTRL_OUTMODE_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CTRL, field COINIT[3] (RW)
 *
 * This bit enables another counter/timer within the module to force the
 * re-initialization of this counter/timer when it has an active compare event.
 *
 * Values:
 * - 0 - Co-channel counter/timers cannot force a re-initialization of this
 *     counter/timer
 * - 1 - Co-channel counter/timers may force a re-initialization of this
 *     counter/timer
 */
/*@{*/
/*! @brief Read current value of the TMR_CTRL_COINIT field. */
#define TMR_RD_CTRL_COINIT(base) ((TMR_CTRL_REG(base) & TMR_CTRL_COINIT_MASK) >> TMR_CTRL_COINIT_SHIFT)
#define TMR_BRD_CTRL_COINIT(base) (BME_UBFX16(&TMR_CTRL_REG(base), TMR_CTRL_COINIT_SHIFT, TMR_CTRL_COINIT_WIDTH))

/*! @brief Set the COINIT field to a new value. */
#define TMR_WR_CTRL_COINIT(base, value) (TMR_RMW_CTRL(base, TMR_CTRL_COINIT_MASK, TMR_CTRL_COINIT(value)))
#define TMR_BWR_CTRL_COINIT(base, value) (BME_BFI16(&TMR_CTRL_REG(base), ((uint16_t)(value) << TMR_CTRL_COINIT_SHIFT), TMR_CTRL_COINIT_SHIFT, TMR_CTRL_COINIT_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CTRL, field DIR[4] (RW)
 *
 * This bit selects either the normal count direction up, or the reverse
 * direction, down.
 *
 * Values:
 * - 0 - Count up.
 * - 1 - Count down.
 */
/*@{*/
/*! @brief Read current value of the TMR_CTRL_DIR field. */
#define TMR_RD_CTRL_DIR(base) ((TMR_CTRL_REG(base) & TMR_CTRL_DIR_MASK) >> TMR_CTRL_DIR_SHIFT)
#define TMR_BRD_CTRL_DIR(base) (BME_UBFX16(&TMR_CTRL_REG(base), TMR_CTRL_DIR_SHIFT, TMR_CTRL_DIR_WIDTH))

/*! @brief Set the DIR field to a new value. */
#define TMR_WR_CTRL_DIR(base, value) (TMR_RMW_CTRL(base, TMR_CTRL_DIR_MASK, TMR_CTRL_DIR(value)))
#define TMR_BWR_CTRL_DIR(base, value) (BME_BFI16(&TMR_CTRL_REG(base), ((uint16_t)(value) << TMR_CTRL_DIR_SHIFT), TMR_CTRL_DIR_SHIFT, TMR_CTRL_DIR_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CTRL, field LENGTH[5] (RW)
 *
 * This bit determines whether the counter: counts to the compare value and then
 * re-initializes itself to the value specified in the LOAD (or CMPLD2)
 * register, or continues counting past the compare value to the binary roll over.
 *
 * Values:
 * - 0 - Roll over.
 * - 1 - Count until compare, then re-initialize. If counting up, a successful
 *     compare occurs when the counter reaches a COMP1 value. If counting down, a
 *     successful compare occurs when the counter reaches a COMP2 value. When
 *     output mode $4 is used, alternating values of COMP1 and COMP2 are used to
 *     generate successful comparisons. For example, the counter counts until a
 *     COMP1 value is reached, re-initializes, counts until COMP2 value is reached,
 *     re-initializes, counts until COMP1 value is reached, and so on.
 */
/*@{*/
/*! @brief Read current value of the TMR_CTRL_LENGTH field. */
#define TMR_RD_CTRL_LENGTH(base) ((TMR_CTRL_REG(base) & TMR_CTRL_LENGTH_MASK) >> TMR_CTRL_LENGTH_SHIFT)
#define TMR_BRD_CTRL_LENGTH(base) (BME_UBFX16(&TMR_CTRL_REG(base), TMR_CTRL_LENGTH_SHIFT, TMR_CTRL_LENGTH_WIDTH))

/*! @brief Set the LENGTH field to a new value. */
#define TMR_WR_CTRL_LENGTH(base, value) (TMR_RMW_CTRL(base, TMR_CTRL_LENGTH_MASK, TMR_CTRL_LENGTH(value)))
#define TMR_BWR_CTRL_LENGTH(base, value) (BME_BFI16(&TMR_CTRL_REG(base), ((uint16_t)(value) << TMR_CTRL_LENGTH_SHIFT), TMR_CTRL_LENGTH_SHIFT, TMR_CTRL_LENGTH_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CTRL, field ONCE[6] (RW)
 *
 * This bit selects continuous or one shot counting mode.
 *
 * Values:
 * - 0 - Count repeatedly.
 * - 1 - Count until compare and then stop. If counting up, a successful compare
 *     occurs when the counter reaches a COMP1 value. If counting down, a
 *     successful compare occurs when the counter reaches a COMP2 value. When output
 *     mode $4 is used, the counter re-initializes after reaching the COMP1 value,
 *     continues to count to the COMP2 value, and then stops.
 */
/*@{*/
/*! @brief Read current value of the TMR_CTRL_ONCE field. */
#define TMR_RD_CTRL_ONCE(base) ((TMR_CTRL_REG(base) & TMR_CTRL_ONCE_MASK) >> TMR_CTRL_ONCE_SHIFT)
#define TMR_BRD_CTRL_ONCE(base) (BME_UBFX16(&TMR_CTRL_REG(base), TMR_CTRL_ONCE_SHIFT, TMR_CTRL_ONCE_WIDTH))

