pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*! @brief Set the VAL field to a new value. */
#define TMR_WR_SCTRL_VAL(base, value) (TMR_RMW_SCTRL(base, TMR_SCTRL_VAL_MASK, TMR_SCTRL_VAL(value)))
#define TMR_BWR_SCTRL_VAL(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_VAL_SHIFT), TMR_SCTRL_VAL_SHIFT, TMR_SCTRL_VAL_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field EEOF[4] (RW)
 *
 * This bit (when set) enables the compare from another counter/timer within the
 * same module to force the state of this counter's OFLAG output signal.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_EEOF field. */
#define TMR_RD_SCTRL_EEOF(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_EEOF_MASK) >> TMR_SCTRL_EEOF_SHIFT)
#define TMR_BRD_SCTRL_EEOF(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_EEOF_SHIFT, TMR_SCTRL_EEOF_WIDTH))

/*! @brief Set the EEOF field to a new value. */
#define TMR_WR_SCTRL_EEOF(base, value) (TMR_RMW_SCTRL(base, TMR_SCTRL_EEOF_MASK, TMR_SCTRL_EEOF(value)))
#define TMR_BWR_SCTRL_EEOF(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_EEOF_SHIFT), TMR_SCTRL_EEOF_SHIFT, TMR_SCTRL_EEOF_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field MSTR[5] (RW)
 *
 * This bit (when set) enables the compare function's output to be broadcasted
 * to the other counters/timers in the module. This signal then can be used to
 * re-initialize the other counters and/or force their OFLAG signal outputs.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_MSTR field. */
#define TMR_RD_SCTRL_MSTR(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_MSTR_MASK) >> TMR_SCTRL_MSTR_SHIFT)
#define TMR_BRD_SCTRL_MSTR(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_MSTR_SHIFT, TMR_SCTRL_MSTR_WIDTH))

/*! @brief Set the MSTR field to a new value. */
#define TMR_WR_SCTRL_MSTR(base, value) (TMR_RMW_SCTRL(base, TMR_SCTRL_MSTR_MASK, TMR_SCTRL_MSTR(value)))
#define TMR_BWR_SCTRL_MSTR(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_MSTR_SHIFT), TMR_SCTRL_MSTR_SHIFT, TMR_SCTRL_MSTR_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field CAPTURE_MODE[7:6] (RW)
 *
 * These bits specify the operation of the capture register as well as the
 * operation of the input edge flag. The input source is the secondary count source.
 *
 * Values:
 * - 00 - Capture function is disabled
 * - 01 - Load capture register on rising edge (when IPS=0) or falling edge
 *     (when IPS=1) of input
 * - 10 - Load capture register on falling edge (when IPS=0) or rising edge
 *     (when IPS=1) of input
 * - 11 - Load capture register on both edges of input
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_CAPTURE_MODE field. */
#define TMR_RD_SCTRL_CAPTURE_MODE(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_CAPTURE_MODE_MASK) >> TMR_SCTRL_CAPTURE_MODE_SHIFT)
#define TMR_BRD_SCTRL_CAPTURE_MODE(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_CAPTURE_MODE_SHIFT, TMR_SCTRL_CAPTURE_MODE_WIDTH))

/*! @brief Set the CAPTURE_MODE field to a new value. */
#define TMR_WR_SCTRL_CAPTURE_MODE(base, value) (TMR_RMW_SCTRL(base, TMR_SCTRL_CAPTURE_MODE_MASK, TMR_SCTRL_CAPTURE_MODE(value)))
#define TMR_BWR_SCTRL_CAPTURE_MODE(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_CAPTURE_MODE_SHIFT), TMR_SCTRL_CAPTURE_MODE_SHIFT, TMR_SCTRL_CAPTURE_MODE_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field INPUT[8] (RO)
 *
 * This read only bit reflects the current state of the external input pin
 * selected via the secondary count source after application of IPS and filtering.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_INPUT field. */
#define TMR_RD_SCTRL_INPUT(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_INPUT_MASK) >> TMR_SCTRL_INPUT_SHIFT)
#define TMR_BRD_SCTRL_INPUT(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_INPUT_SHIFT, TMR_SCTRL_INPUT_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field IPS[9] (RW)
 *
 * This bit (when set) inverts the input signal polarity.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_IPS field. */
#define TMR_RD_SCTRL_IPS(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_IPS_MASK) >> TMR_SCTRL_IPS_SHIFT)
#define TMR_BRD_SCTRL_IPS(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_IPS_SHIFT, TMR_SCTRL_IPS_WIDTH))

/*! @brief Set the IPS field to a new value. */
#define TMR_WR_SCTRL_IPS(base, value) (TMR_RMW_SCTRL(base, TMR_SCTRL_IPS_MASK, TMR_SCTRL_IPS(value)))
#define TMR_BWR_SCTRL_IPS(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_IPS_SHIFT), TMR_SCTRL_IPS_SHIFT, TMR_SCTRL_IPS_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field IEFIE[10] (RW)
 *
 * This bit (when set) enables interrupts when IEF is set.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_IEFIE field. */
#define TMR_RD_SCTRL_IEFIE(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_IEFIE_MASK) >> TMR_SCTRL_IEFIE_SHIFT)
#define TMR_BRD_SCTRL_IEFIE(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_IEFIE_SHIFT, TMR_SCTRL_IEFIE_WIDTH))

/*! @brief Set the IEFIE field to a new value. */
#define TMR_WR_SCTRL_IEFIE(base, value) (TMR_RMW_SCTRL(base, TMR_SCTRL_IEFIE_MASK, TMR_SCTRL_IEFIE(value)))
#define TMR_BWR_SCTRL_IEFIE(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_IEFIE_SHIFT), TMR_SCTRL_IEFIE_SHIFT, TMR_SCTRL_IEFIE_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field IEF[11] (RW)
 *
 * This bit is set when CAPTMODE is enabled and a proper input transition occurs
 * (on an input selected as a secondary count source) while the count mode does
 * not equal 000. This bit is cleared by writing a zero to this bit position.
 * Setting the input polarity select bit (IPS) changes the edge to be detected.
 * Also, the control register's secondary count source determines which external
 * input pin is monitored by the detection circuitry.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_IEF field. */
#define TMR_RD_SCTRL_IEF(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_IEF_MASK) >> TMR_SCTRL_IEF_SHIFT)
#define TMR_BRD_SCTRL_IEF(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_IEF_SHIFT, TMR_SCTRL_IEF_WIDTH))

/*! @brief Set the IEF field to a new value. */
#define TMR_WR_SCTRL_IEF(base, value) (TMR_RMW_SCTRL(base, TMR_SCTRL_IEF_MASK, TMR_SCTRL_IEF(value)))
#define TMR_BWR_SCTRL_IEF(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_IEF_SHIFT), TMR_SCTRL_IEF_SHIFT, TMR_SCTRL_IEF_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field TOFIE[12] (RW)
 *
 * This bit (when set) enables interrupts when TOF is set.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_TOFIE field. */
#define TMR_RD_SCTRL_TOFIE(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_TOFIE_MASK) >> TMR_SCTRL_TOFIE_SHIFT)
#define TMR_BRD_SCTRL_TOFIE(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_TOFIE_SHIFT, TMR_SCTRL_TOFIE_WIDTH))

/*! @brief Set the TOFIE field to a new value. */
#define TMR_WR_SCTRL_TOFIE(base, value) (TMR_RMW_SCTRL(base, TMR_SCTRL_TOFIE_MASK, TMR_SCTRL_TOFIE(value)))
#define TMR_BWR_SCTRL_TOFIE(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_TOFIE_SHIFT), TMR_SCTRL_TOFIE_SHIFT, TMR_SCTRL_TOFIE_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field TOF[13] (RW)
 *
 * This bit is set when the counter rolls over its maximum value $FFFF or $0000
 * (depending on count direction). This bit is cleared by writing a zero to this
 * bit location.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_TOF field. */
#define TMR_RD_SCTRL_TOF(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_TOF_MASK) >> TMR_SCTRL_TOF_SHIFT)
#define TMR_BRD_SCTRL_TOF(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_TOF_SHIFT, TMR_SCTRL_TOF_WIDTH))

