pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*! @brief Set the TOF field to a new value. */
#define TMR_WR_SCTRL_TOF(base, value) (TMR_RMW_SCTRL(base, TMR_SCTRL_TOF_MASK, TMR_SCTRL_TOF(value)))
#define TMR_BWR_SCTRL_TOF(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_TOF_SHIFT), TMR_SCTRL_TOF_SHIFT, TMR_SCTRL_TOF_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field TCFIE[14] (RW)
 *
 * This bit (when set) enables interrupts when TCF is set.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_TCFIE field. */
#define TMR_RD_SCTRL_TCFIE(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_TCFIE_MASK) >> TMR_SCTRL_TCFIE_SHIFT)
#define TMR_BRD_SCTRL_TCFIE(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_TCFIE_SHIFT, TMR_SCTRL_TCFIE_WIDTH))

/*! @brief Set the TCFIE field to a new value. */
#define TMR_WR_SCTRL_TCFIE(base, value) (TMR_RMW_SCTRL(base, TMR_SCTRL_TCFIE_MASK, TMR_SCTRL_TCFIE(value)))
#define TMR_BWR_SCTRL_TCFIE(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_TCFIE_SHIFT), TMR_SCTRL_TCFIE_SHIFT, TMR_SCTRL_TCFIE_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field TCF[15] (RW)
 *
 * This bit is set when a successful compare occurs. This bit is cleared by
 * writing a zero to this bit location.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_TCF field. */
#define TMR_RD_SCTRL_TCF(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_TCF_MASK) >> TMR_SCTRL_TCF_SHIFT)
#define TMR_BRD_SCTRL_TCF(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_TCF_SHIFT, TMR_SCTRL_TCF_WIDTH))

/*! @brief Set the TCF field to a new value. */
#define TMR_WR_SCTRL_TCF(base, value) (TMR_RMW_SCTRL(base, TMR_SCTRL_TCF_MASK, TMR_SCTRL_TCF(value)))
#define TMR_BWR_SCTRL_TCF(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_TCF_SHIFT), TMR_SCTRL_TCF_SHIFT, TMR_SCTRL_TCF_WIDTH))
/*@}*/

/*******************************************************************************
 * TMR_CMPLD1 - Timer Channel Comparator Load Register 1
 ******************************************************************************/

/*!
 * @brief TMR_CMPLD1 - Timer Channel Comparator Load Register 1 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_CMPLD1 register
 */
/*@{*/
#define TMR_RD_CMPLD1(base)      (TMR_CMPLD1_REG(base))
#define TMR_WR_CMPLD1(base, value) (TMR_CMPLD1_REG(base) = (value))
#define TMR_RMW_CMPLD1(base, mask, value) (TMR_WR_CMPLD1(base, (TMR_RD_CMPLD1(base) & ~(mask)) | (value)))
#define TMR_SET_CMPLD1(base, value) (BME_OR16(&TMR_CMPLD1_REG(base), (uint16_t)(value)))
#define TMR_CLR_CMPLD1(base, value) (BME_AND16(&TMR_CMPLD1_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_CMPLD1(base, value) (BME_XOR16(&TMR_CMPLD1_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * TMR_CMPLD2 - Timer Channel Comparator Load Register 2
 ******************************************************************************/

/*!
 * @brief TMR_CMPLD2 - Timer Channel Comparator Load Register 2 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_CMPLD2 register
 */
/*@{*/
#define TMR_RD_CMPLD2(base)      (TMR_CMPLD2_REG(base))
#define TMR_WR_CMPLD2(base, value) (TMR_CMPLD2_REG(base) = (value))
#define TMR_RMW_CMPLD2(base, mask, value) (TMR_WR_CMPLD2(base, (TMR_RD_CMPLD2(base) & ~(mask)) | (value)))
#define TMR_SET_CMPLD2(base, value) (BME_OR16(&TMR_CMPLD2_REG(base), (uint16_t)(value)))
#define TMR_CLR_CMPLD2(base, value) (BME_AND16(&TMR_CMPLD2_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_CMPLD2(base, value) (BME_XOR16(&TMR_CMPLD2_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * TMR_CSCTRL - Timer Channel Comparator Status and Control Register
 ******************************************************************************/

/*!
 * @brief TMR_CSCTRL - Timer Channel Comparator Status and Control Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_CSCTRL register
 */
/*@{*/
#define TMR_RD_CSCTRL(base)      (TMR_CSCTRL_REG(base))
#define TMR_WR_CSCTRL(base, value) (TMR_CSCTRL_REG(base) = (value))
#define TMR_RMW_CSCTRL(base, mask, value) (TMR_WR_CSCTRL(base, (TMR_RD_CSCTRL(base) & ~(mask)) | (value)))
#define TMR_SET_CSCTRL(base, value) (BME_OR16(&TMR_CSCTRL_REG(base), (uint16_t)(value)))
#define TMR_CLR_CSCTRL(base, value) (BME_AND16(&TMR_CSCTRL_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_CSCTRL(base, value) (BME_XOR16(&TMR_CSCTRL_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TMR_CSCTRL bitfields
 */

/*!
 * @name Register TMR_CSCTRL, field CL1[1:0] (RW)
 *
 * These bits control when COMP1 is preloaded with the value from CMPLD1.
 *
 * Values:
 * - 00 - Never preload
 * - 01 - Load upon successful compare with the value in COMP1
 * - 10 - Load upon successful compare with the value in COMP2
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_CL1 field. */
#define TMR_RD_CSCTRL_CL1(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_CL1_MASK) >> TMR_CSCTRL_CL1_SHIFT)
#define TMR_BRD_CSCTRL_CL1(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_CL1_SHIFT, TMR_CSCTRL_CL1_WIDTH))

/*! @brief Set the CL1 field to a new value. */
#define TMR_WR_CSCTRL_CL1(base, value) (TMR_RMW_CSCTRL(base, TMR_CSCTRL_CL1_MASK, TMR_CSCTRL_CL1(value)))
#define TMR_BWR_CSCTRL_CL1(base, value) (BME_BFI16(&TMR_CSCTRL_REG(base), ((uint16_t)(value) << TMR_CSCTRL_CL1_SHIFT), TMR_CSCTRL_CL1_SHIFT, TMR_CSCTRL_CL1_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field CL2[3:2] (RW)
 *
 * These bits control when COMP2 is preloaded with the value from CMPLD2.
 *
 * Values:
 * - 00 - Never preload
 * - 01 - Load upon successful compare with the value in COMP1
 * - 10 - Load upon successful compare with the value in COMP2
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_CL2 field. */
#define TMR_RD_CSCTRL_CL2(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_CL2_MASK) >> TMR_CSCTRL_CL2_SHIFT)
#define TMR_BRD_CSCTRL_CL2(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_CL2_SHIFT, TMR_CSCTRL_CL2_WIDTH))

