pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*! @brief Set the ALT_LOAD field to a new value. */
#define TMR_WR_CSCTRL_ALT_LOAD(base, value) (TMR_RMW_CSCTRL(base, TMR_CSCTRL_ALT_LOAD_MASK, TMR_CSCTRL_ALT_LOAD(value)))
#define TMR_BWR_CSCTRL_ALT_LOAD(base, value) (BME_BFI16(&TMR_CSCTRL_REG(base), ((uint16_t)(value) << TMR_CSCTRL_ALT_LOAD_SHIFT), TMR_CSCTRL_ALT_LOAD_SHIFT, TMR_CSCTRL_ALT_LOAD_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field FAULT[13] (RW)
 *
 * The selected secondary input acts as a fault signal so that the timer OFLAG
 * is cleared when the secondary input is set. When the secondary input is used in
 * this mode, there is no resynchronization of the input so that there is a
 * combinational path to clear the OFLAG. Fault inputs less than two clock periods
 * wide will not be latched. Latched faults will be cleared the next time that the
 * counter logic sets the OFLAG.
 *
 * Values:
 * - 0 - Fault function disabled.
 * - 1 - Fault function enabled.
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_FAULT field. */
#define TMR_RD_CSCTRL_FAULT(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_FAULT_MASK) >> TMR_CSCTRL_FAULT_SHIFT)
#define TMR_BRD_CSCTRL_FAULT(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_FAULT_SHIFT, TMR_CSCTRL_FAULT_WIDTH))

/*! @brief Set the FAULT field to a new value. */
#define TMR_WR_CSCTRL_FAULT(base, value) (TMR_RMW_CSCTRL(base, TMR_CSCTRL_FAULT_MASK, TMR_CSCTRL_FAULT(value)))
#define TMR_BWR_CSCTRL_FAULT(base, value) (BME_BFI16(&TMR_CSCTRL_REG(base), ((uint16_t)(value) << TMR_CSCTRL_FAULT_SHIFT), TMR_CSCTRL_FAULT_SHIFT, TMR_CSCTRL_FAULT_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field DBG_EN[15:14] (RW)
 *
 * These bits allow the TMR module to perform certain actions in response to the
 * chip entering debug mode.
 *
 * Values:
 * - 00 - Continue with normal operation during debug mode. (default)
 * - 01 - Halt TMR counter during debug mode.
 * - 10 - Force TMR output to logic 0 (prior to consideration of SCTRL[OPS]).
 * - 11 - Both halt counter and force output to 0 during debug mode.
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_DBG_EN field. */
#define TMR_RD_CSCTRL_DBG_EN(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_DBG_EN_MASK) >> TMR_CSCTRL_DBG_EN_SHIFT)
#define TMR_BRD_CSCTRL_DBG_EN(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_DBG_EN_SHIFT, TMR_CSCTRL_DBG_EN_WIDTH))

/*! @brief Set the DBG_EN field to a new value. */
#define TMR_WR_CSCTRL_DBG_EN(base, value) (TMR_RMW_CSCTRL(base, TMR_CSCTRL_DBG_EN_MASK, TMR_CSCTRL_DBG_EN(value)))
#define TMR_BWR_CSCTRL_DBG_EN(base, value) (BME_BFI16(&TMR_CSCTRL_REG(base), ((uint16_t)(value) << TMR_CSCTRL_DBG_EN_SHIFT), TMR_CSCTRL_DBG_EN_SHIFT, TMR_CSCTRL_DBG_EN_WIDTH))
/*@}*/

/*******************************************************************************
 * TMR_FILT - Timer Channel Input Filter Register
 ******************************************************************************/

/*!
 * @brief TMR_FILT - Timer Channel Input Filter Register (RW)
 *
 * Reset value: 0x0000U
 *
 * Input filter considerations: Set the FILT_PER value such that the sampling
 * period is larger than the period of the expected noise. In this way, a noise
 * spike will corrupt only one sample. Choose the FILT_CNT value to reduce the
 * probability that noisy samples cause an incorrect transition to be recognized. The
 * probability of an incorrect transistion is defined as the probability of an
 * incorrect sample raised to the power of (FILT_CNT + 3). The values of FILT_PER
 * and FILT_CNT must also be balanced against the desire for minimal latency in
 * recognizing input transitions. Turning on the input filter (setting FILT_PER to
 * a non-zero value) introduces a latency of (((FILT_CNT + 3) x FILT_PER) + 2) IP
 * bus clock periods.
 */
/*!
 * @name Constants and macros for entire TMR_FILT register
 */
/*@{*/
#define TMR_RD_FILT(base)        (TMR_FILT_REG(base))
#define TMR_WR_FILT(base, value) (TMR_FILT_REG(base) = (value))
#define TMR_RMW_FILT(base, mask, value) (TMR_WR_FILT(base, (TMR_RD_FILT(base) & ~(mask)) | (value)))
#define TMR_SET_FILT(base, value) (BME_OR16(&TMR_FILT_REG(base), (uint16_t)(value)))
#define TMR_CLR_FILT(base, value) (BME_AND16(&TMR_FILT_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_FILT(base, value) (BME_XOR16(&TMR_FILT_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TMR_FILT bitfields
 */

/*!
 * @name Register TMR_FILT, field FILT_PER[7:0] (RW)
 *
 * These bits represent the sampling period (in IP bus clock cycles) of the TMR
 * input signals. Each input is sampled multiple times at the rate specified by
 * this field. If FILT_PER is 0x00 (default), then the input filter is bypassed.
 * The value of FILT_PER affects the input latency. When changing values for
 * FILT_PER from one non-zero value to another non-zero value, write a value of zero
 * first to clear the filter.
 */
/*@{*/
/*! @brief Read current value of the TMR_FILT_FILT_PER field. */
#define TMR_RD_FILT_FILT_PER(base) ((TMR_FILT_REG(base) & TMR_FILT_FILT_PER_MASK) >> TMR_FILT_FILT_PER_SHIFT)
#define TMR_BRD_FILT_FILT_PER(base) (BME_UBFX16(&TMR_FILT_REG(base), TMR_FILT_FILT_PER_SHIFT, TMR_FILT_FILT_PER_WIDTH))

/*! @brief Set the FILT_PER field to a new value. */
#define TMR_WR_FILT_FILT_PER(base, value) (TMR_RMW_FILT(base, TMR_FILT_FILT_PER_MASK, TMR_FILT_FILT_PER(value)))
#define TMR_BWR_FILT_FILT_PER(base, value) (BME_BFI16(&TMR_FILT_REG(base), ((uint16_t)(value) << TMR_FILT_FILT_PER_SHIFT), TMR_FILT_FILT_PER_SHIFT, TMR_FILT_FILT_PER_WIDTH))
/*@}*/

/*!
 * @name Register TMR_FILT, field FILT_CNT[10:8] (RW)
 *
 * These bits represent the number of consecutive samples that must agree prior
 * to the input filter accepting an input transition. A value of 0x0 represents 3
 * samples. A value of 0x7 represents 10 samples. The value of FILT_CNT affects
 * the input latency.
 */
/*@{*/
/*! @brief Read current value of the TMR_FILT_FILT_CNT field. */
#define TMR_RD_FILT_FILT_CNT(base) ((TMR_FILT_REG(base) & TMR_FILT_FILT_CNT_MASK) >> TMR_FILT_FILT_CNT_SHIFT)
#define TMR_BRD_FILT_FILT_CNT(base) (BME_UBFX16(&TMR_FILT_REG(base), TMR_FILT_FILT_CNT_SHIFT, TMR_FILT_FILT_CNT_WIDTH))

/*! @brief Set the FILT_CNT field to a new value. */
#define TMR_WR_FILT_FILT_CNT(base, value) (TMR_RMW_FILT(base, TMR_FILT_FILT_CNT_MASK, TMR_FILT_FILT_CNT(value)))
#define TMR_BWR_FILT_FILT_CNT(base, value) (BME_BFI16(&TMR_FILT_REG(base), ((uint16_t)(value) << TMR_FILT_FILT_CNT_SHIFT), TMR_FILT_FILT_CNT_SHIFT, TMR_FILT_FILT_CNT_WIDTH))
/*@}*/

