pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*
 * Constants & macros for individual VREF_VREFH_TRM bitfields
 */

/*!
 * @name Register VREF_VREFH_TRM, field TRIM[5:0] (RW)
 *
 * These bits change the resulting VREF by approximately +/- 0.5 mV for each
 * step. Min = minimum and max = maximum voltage reference output. For minimum and
 * maximum voltage reference output values, refer to the Data Sheet for this chip.
 *
 * Values:
 * - 000000 - Min
 * - 111111 - Max
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFH_TRM_TRIM field. */
#define VREF_RD_VREFH_TRM_TRIM(base) ((VREF_VREFH_TRM_REG(base) & VREF_VREFH_TRM_TRIM_MASK) >> VREF_VREFH_TRM_TRIM_SHIFT)
#define VREF_BRD_VREFH_TRM_TRIM(base) (BME_UBFX8(&VREF_VREFH_TRM_REG(base), VREF_VREFH_TRM_TRIM_SHIFT, VREF_VREFH_TRM_TRIM_WIDTH))

/*! @brief Set the TRIM field to a new value. */
#define VREF_WR_VREFH_TRM_TRIM(base, value) (VREF_RMW_VREFH_TRM(base, VREF_VREFH_TRM_TRIM_MASK, VREF_VREFH_TRM_TRIM(value)))
#define VREF_BWR_VREFH_TRM_TRIM(base, value) (BME_BFI8(&VREF_VREFH_TRM_REG(base), ((uint8_t)(value) << VREF_VREFH_TRM_TRIM_SHIFT), VREF_VREFH_TRM_TRIM_SHIFT, VREF_VREFH_TRM_TRIM_WIDTH))
/*@}*/

/*!
 * @name Register VREF_VREFH_TRM, field CHOPEN[6] (RW)
 *
 * This bit is set during factory trimming of the VREF voltage. This bit should
 * be written to 1 to achieve the performance stated in the data sheet.
 *
 * Values:
 * - 0 - Chop oscillator is disabled.
 * - 1 - Chop oscillator is enabled.
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFH_TRM_CHOPEN field. */
#define VREF_RD_VREFH_TRM_CHOPEN(base) ((VREF_VREFH_TRM_REG(base) & VREF_VREFH_TRM_CHOPEN_MASK) >> VREF_VREFH_TRM_CHOPEN_SHIFT)
#define VREF_BRD_VREFH_TRM_CHOPEN(base) (BME_UBFX8(&VREF_VREFH_TRM_REG(base), VREF_VREFH_TRM_CHOPEN_SHIFT, VREF_VREFH_TRM_CHOPEN_WIDTH))

/*! @brief Set the CHOPEN field to a new value. */
#define VREF_WR_VREFH_TRM_CHOPEN(base, value) (VREF_RMW_VREFH_TRM(base, VREF_VREFH_TRM_CHOPEN_MASK, VREF_VREFH_TRM_CHOPEN(value)))
#define VREF_BWR_VREFH_TRM_CHOPEN(base, value) (BME_BFI8(&VREF_VREFH_TRM_REG(base), ((uint8_t)(value) << VREF_VREFH_TRM_CHOPEN_SHIFT), VREF_VREFH_TRM_CHOPEN_SHIFT, VREF_VREFH_TRM_CHOPEN_WIDTH))
/*@}*/

/*******************************************************************************
 * VREF_VREFH_SC - VREF Status and Control Register
 ******************************************************************************/

/*!
 * @brief VREF_VREFH_SC - VREF Status and Control Register (RW)
 *
 * Reset value: 0x20U
 *
 * This register contains the control bits used to enable the internal voltage
 * reference and to select the buffer mode to be used.
 */
/*!
 * @name Constants and macros for entire VREF_VREFH_SC register
 */
/*@{*/
#define VREF_RD_VREFH_SC(base)   (VREF_VREFH_SC_REG(base))
#define VREF_WR_VREFH_SC(base, value) (VREF_VREFH_SC_REG(base) = (value))
#define VREF_RMW_VREFH_SC(base, mask, value) (VREF_WR_VREFH_SC(base, (VREF_RD_VREFH_SC(base) & ~(mask)) | (value)))
#define VREF_SET_VREFH_SC(base, value) (BME_OR8(&VREF_VREFH_SC_REG(base), (uint8_t)(value)))
#define VREF_CLR_VREFH_SC(base, value) (BME_AND8(&VREF_VREFH_SC_REG(base), (uint8_t)(~(value))))
#define VREF_TOG_VREFH_SC(base, value) (BME_XOR8(&VREF_VREFH_SC_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual VREF_VREFH_SC bitfields
 */

/*!
 * @name Register VREF_VREFH_SC, field MODE_LV[1:0] (RW)
 *
 * These bits select the buffer modes for the Voltage Reference module.
 *
 * Values:
 * - 00 - Bandgap on only, for stabilization and startup
 * - 01 - High power buffer mode enabled
 * - 10 - Low-power buffer mode enabled
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFH_SC_MODE_LV field. */
#define VREF_RD_VREFH_SC_MODE_LV(base) ((VREF_VREFH_SC_REG(base) & VREF_VREFH_SC_MODE_LV_MASK) >> VREF_VREFH_SC_MODE_LV_SHIFT)
#define VREF_BRD_VREFH_SC_MODE_LV(base) (BME_UBFX8(&VREF_VREFH_SC_REG(base), VREF_VREFH_SC_MODE_LV_SHIFT, VREF_VREFH_SC_MODE_LV_WIDTH))

/*! @brief Set the MODE_LV field to a new value. */
#define VREF_WR_VREFH_SC_MODE_LV(base, value) (VREF_RMW_VREFH_SC(base, VREF_VREFH_SC_MODE_LV_MASK, VREF_VREFH_SC_MODE_LV(value)))
#define VREF_BWR_VREFH_SC_MODE_LV(base, value) (BME_BFI8(&VREF_VREFH_SC_REG(base), ((uint8_t)(value) << VREF_VREFH_SC_MODE_LV_SHIFT), VREF_VREFH_SC_MODE_LV_SHIFT, VREF_VREFH_SC_MODE_LV_WIDTH))
/*@}*/

/*!
 * @name Register VREF_VREFH_SC, field VREFST[2] (RO)
 *
 * This bit indicates that the bandgap reference within the Voltage Reference
 * module has completed its startup and stabilization.
 *
 * Values:
 * - 0 - The module is disabled or not stable.
 * - 1 - The module is stable.
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFH_SC_VREFST field. */
#define VREF_RD_VREFH_SC_VREFST(base) ((VREF_VREFH_SC_REG(base) & VREF_VREFH_SC_VREFST_MASK) >> VREF_VREFH_SC_VREFST_SHIFT)
#define VREF_BRD_VREFH_SC_VREFST(base) (BME_UBFX8(&VREF_VREFH_SC_REG(base), VREF_VREFH_SC_VREFST_SHIFT, VREF_VREFH_SC_VREFST_WIDTH))
/*@}*/

/*!
 * @name Register VREF_VREFH_SC, field ICOMPEN[5] (RW)
 *
 * This bit is set during factory trimming of the VREF voltage. This bit should
 * be written to 1 to achieve the performance stated in the data sheet.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFH_SC_ICOMPEN field. */
#define VREF_RD_VREFH_SC_ICOMPEN(base) ((VREF_VREFH_SC_REG(base) & VREF_VREFH_SC_ICOMPEN_MASK) >> VREF_VREFH_SC_ICOMPEN_SHIFT)
#define VREF_BRD_VREFH_SC_ICOMPEN(base) (BME_UBFX8(&VREF_VREFH_SC_REG(base), VREF_VREFH_SC_ICOMPEN_SHIFT, VREF_VREFH_SC_ICOMPEN_WIDTH))

/*! @brief Set the ICOMPEN field to a new value. */
#define VREF_WR_VREFH_SC_ICOMPEN(base, value) (VREF_RMW_VREFH_SC(base, VREF_VREFH_SC_ICOMPEN_MASK, VREF_VREFH_SC_ICOMPEN(value)))
#define VREF_BWR_VREFH_SC_ICOMPEN(base, value) (BME_BFI8(&VREF_VREFH_SC_REG(base), ((uint8_t)(value) << VREF_VREFH_SC_ICOMPEN_SHIFT), VREF_VREFH_SC_ICOMPEN_SHIFT, VREF_VREFH_SC_ICOMPEN_WIDTH))
/*@}*/

/*!
 * @name Register VREF_VREFH_SC, field REGEN[6] (RW)
 *
 * This bit is used to enable the internal 1.75 V regulator to produce a
 * constant internal voltage supply in order to reduce the sensitivity to external
 * supply noise and variation. If it is desired to keep the regulator enabled in very
 * low power modes, refer to the Chip Configuration chapter for a description on
 * how this can be achieved. This bit is set during factory trimming of the VREF
 * voltage. This bit should be written to 1 to achieve the performance stated in
 * the data sheet.
 *
 * Values:
 * - 0 - Internal 1.75 V regulator is disabled.
 * - 1 - Internal 1.75 V regulator is enabled.
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFH_SC_REGEN field. */
#define VREF_RD_VREFH_SC_REGEN(base) ((VREF_VREFH_SC_REG(base) & VREF_VREFH_SC_REGEN_MASK) >> VREF_VREFH_SC_REGEN_SHIFT)
#define VREF_BRD_VREFH_SC_REGEN(base) (BME_UBFX8(&VREF_VREFH_SC_REG(base), VREF_VREFH_SC_REGEN_SHIFT, VREF_VREFH_SC_REGEN_WIDTH))

/*! @brief Set the REGEN field to a new value. */
#define VREF_WR_VREFH_SC_REGEN(base, value) (VREF_RMW_VREFH_SC(base, VREF_VREFH_SC_REGEN_MASK, VREF_VREFH_SC_REGEN(value)))
#define VREF_BWR_VREFH_SC_REGEN(base, value) (BME_BFI8(&VREF_VREFH_SC_REG(base), ((uint8_t)(value) << VREF_VREFH_SC_REGEN_SHIFT), VREF_VREFH_SC_REGEN_SHIFT, VREF_VREFH_SC_REGEN_WIDTH))
/*@}*/

/*!
 * @name Register VREF_VREFH_SC, field VREFEN[7] (RW)
 *
 * This bit is used to enable the bandgap reference within the Voltage Reference
 * module. After the VREF is enabled, turning off the clock to the VREF module
 * via the corresponding clock gate register will not disable the VREF. VREF must
 * be disabled via this VREFEN bit.
 *
 * Values:
 * - 0 - The module is disabled.
 * - 1 - The module is enabled.
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFH_SC_VREFEN field. */
#define VREF_RD_VREFH_SC_VREFEN(base) ((VREF_VREFH_SC_REG(base) & VREF_VREFH_SC_VREFEN_MASK) >> VREF_VREFH_SC_VREFEN_SHIFT)
#define VREF_BRD_VREFH_SC_VREFEN(base) (BME_UBFX8(&VREF_VREFH_SC_REG(base), VREF_VREFH_SC_VREFEN_SHIFT, VREF_VREFH_SC_VREFEN_WIDTH))

/*! @brief Set the VREFEN field to a new value. */
#define VREF_WR_VREFH_SC_VREFEN(base, value) (VREF_RMW_VREFH_SC(base, VREF_VREFH_SC_VREFEN_MASK, VREF_VREFH_SC_VREFEN(value)))
#define VREF_BWR_VREFH_SC_VREFEN(base, value) (BME_BFI8(&VREF_VREFH_SC_REG(base), ((uint8_t)(value) << VREF_VREFH_SC_VREFEN_SHIFT), VREF_VREFH_SC_VREFEN_SHIFT, VREF_VREFH_SC_VREFEN_WIDTH))
/*@}*/

