pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*******************************************************************************
 * XBAR_SEL5 - Crossbar Select Register 5
 ******************************************************************************/

/*!
 * @brief XBAR_SEL5 - Crossbar Select Register 5 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL5 register
 */
/*@{*/
#define XBAR_RD_SEL5(base)       (XBAR_SEL5_REG(base))
#define XBAR_WR_SEL5(base, value) (XBAR_SEL5_REG(base) = (value))
#define XBAR_RMW_SEL5(base, mask, value) (XBAR_WR_SEL5(base, (XBAR_RD_SEL5(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL5(base, value) (BME_OR16(&XBAR_SEL5_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL5(base, value) (BME_AND16(&XBAR_SEL5_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL5(base, value) (BME_XOR16(&XBAR_SEL5_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL5 bitfields
 */

/*!
 * @name Register XBAR_SEL5, field SEL10[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT10 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL5_SEL10 field. */
#define XBAR_RD_SEL5_SEL10(base) ((XBAR_SEL5_REG(base) & XBAR_SEL5_SEL10_MASK) >> XBAR_SEL5_SEL10_SHIFT)
#define XBAR_BRD_SEL5_SEL10(base) (BME_UBFX16(&XBAR_SEL5_REG(base), XBAR_SEL5_SEL10_SHIFT, XBAR_SEL5_SEL10_WIDTH))

/*! @brief Set the SEL10 field to a new value. */
#define XBAR_WR_SEL5_SEL10(base, value) (XBAR_RMW_SEL5(base, XBAR_SEL5_SEL10_MASK, XBAR_SEL5_SEL10(value)))
#define XBAR_BWR_SEL5_SEL10(base, value) (BME_BFI16(&XBAR_SEL5_REG(base), ((uint16_t)(value) << XBAR_SEL5_SEL10_SHIFT), XBAR_SEL5_SEL10_SHIFT, XBAR_SEL5_SEL10_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL5, field SEL11[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT11 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL5_SEL11 field. */
#define XBAR_RD_SEL5_SEL11(base) ((XBAR_SEL5_REG(base) & XBAR_SEL5_SEL11_MASK) >> XBAR_SEL5_SEL11_SHIFT)
#define XBAR_BRD_SEL5_SEL11(base) (BME_UBFX16(&XBAR_SEL5_REG(base), XBAR_SEL5_SEL11_SHIFT, XBAR_SEL5_SEL11_WIDTH))

/*! @brief Set the SEL11 field to a new value. */
#define XBAR_WR_SEL5_SEL11(base, value) (XBAR_RMW_SEL5(base, XBAR_SEL5_SEL11_MASK, XBAR_SEL5_SEL11(value)))
#define XBAR_BWR_SEL5_SEL11(base, value) (BME_BFI16(&XBAR_SEL5_REG(base), ((uint16_t)(value) << XBAR_SEL5_SEL11_SHIFT), XBAR_SEL5_SEL11_SHIFT, XBAR_SEL5_SEL11_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL6 - Crossbar Select Register 6
 ******************************************************************************/

/*!
 * @brief XBAR_SEL6 - Crossbar Select Register 6 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL6 register
 */
/*@{*/
#define XBAR_RD_SEL6(base)       (XBAR_SEL6_REG(base))
#define XBAR_WR_SEL6(base, value) (XBAR_SEL6_REG(base) = (value))
#define XBAR_RMW_SEL6(base, mask, value) (XBAR_WR_SEL6(base, (XBAR_RD_SEL6(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL6(base, value) (BME_OR16(&XBAR_SEL6_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL6(base, value) (BME_AND16(&XBAR_SEL6_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL6(base, value) (BME_XOR16(&XBAR_SEL6_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL6 bitfields
 */

/*!
 * @name Register XBAR_SEL6, field SEL12[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT12 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL6_SEL12 field. */
#define XBAR_RD_SEL6_SEL12(base) ((XBAR_SEL6_REG(base) & XBAR_SEL6_SEL12_MASK) >> XBAR_SEL6_SEL12_SHIFT)
#define XBAR_BRD_SEL6_SEL12(base) (BME_UBFX16(&XBAR_SEL6_REG(base), XBAR_SEL6_SEL12_SHIFT, XBAR_SEL6_SEL12_WIDTH))

/*! @brief Set the SEL12 field to a new value. */
#define XBAR_WR_SEL6_SEL12(base, value) (XBAR_RMW_SEL6(base, XBAR_SEL6_SEL12_MASK, XBAR_SEL6_SEL12(value)))
#define XBAR_BWR_SEL6_SEL12(base, value) (BME_BFI16(&XBAR_SEL6_REG(base), ((uint16_t)(value) << XBAR_SEL6_SEL12_SHIFT), XBAR_SEL6_SEL12_SHIFT, XBAR_SEL6_SEL12_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL6, field SEL13[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT13 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL6_SEL13 field. */
#define XBAR_RD_SEL6_SEL13(base) ((XBAR_SEL6_REG(base) & XBAR_SEL6_SEL13_MASK) >> XBAR_SEL6_SEL13_SHIFT)
#define XBAR_BRD_SEL6_SEL13(base) (BME_UBFX16(&XBAR_SEL6_REG(base), XBAR_SEL6_SEL13_SHIFT, XBAR_SEL6_SEL13_WIDTH))

/*! @brief Set the SEL13 field to a new value. */
#define XBAR_WR_SEL6_SEL13(base, value) (XBAR_RMW_SEL6(base, XBAR_SEL6_SEL13_MASK, XBAR_SEL6_SEL13(value)))
#define XBAR_BWR_SEL6_SEL13(base, value) (BME_BFI16(&XBAR_SEL6_REG(base), ((uint16_t)(value) << XBAR_SEL6_SEL13_SHIFT), XBAR_SEL6_SEL13_SHIFT, XBAR_SEL6_SEL13_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL7 - Crossbar Select Register 7
 ******************************************************************************/

/*!
 * @brief XBAR_SEL7 - Crossbar Select Register 7 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL7 register
 */
/*@{*/
#define XBAR_RD_SEL7(base)       (XBAR_SEL7_REG(base))
#define XBAR_WR_SEL7(base, value) (XBAR_SEL7_REG(base) = (value))
#define XBAR_RMW_SEL7(base, mask, value) (XBAR_WR_SEL7(base, (XBAR_RD_SEL7(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL7(base, value) (BME_OR16(&XBAR_SEL7_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL7(base, value) (BME_AND16(&XBAR_SEL7_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL7(base, value) (BME_XOR16(&XBAR_SEL7_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL7 bitfields
 */

/*!
 * @name Register XBAR_SEL7, field SEL14[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT14 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL7_SEL14 field. */
#define XBAR_RD_SEL7_SEL14(base) ((XBAR_SEL7_REG(base) & XBAR_SEL7_SEL14_MASK) >> XBAR_SEL7_SEL14_SHIFT)
#define XBAR_BRD_SEL7_SEL14(base) (BME_UBFX16(&XBAR_SEL7_REG(base), XBAR_SEL7_SEL14_SHIFT, XBAR_SEL7_SEL14_WIDTH))

/*! @brief Set the SEL14 field to a new value. */
#define XBAR_WR_SEL7_SEL14(base, value) (XBAR_RMW_SEL7(base, XBAR_SEL7_SEL14_MASK, XBAR_SEL7_SEL14(value)))
#define XBAR_BWR_SEL7_SEL14(base, value) (BME_BFI16(&XBAR_SEL7_REG(base), ((uint16_t)(value) << XBAR_SEL7_SEL14_SHIFT), XBAR_SEL7_SEL14_SHIFT, XBAR_SEL7_SEL14_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL7, field SEL15[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT15 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL7_SEL15 field. */
#define XBAR_RD_SEL7_SEL15(base) ((XBAR_SEL7_REG(base) & XBAR_SEL7_SEL15_MASK) >> XBAR_SEL7_SEL15_SHIFT)
#define XBAR_BRD_SEL7_SEL15(base) (BME_UBFX16(&XBAR_SEL7_REG(base), XBAR_SEL7_SEL15_SHIFT, XBAR_SEL7_SEL15_WIDTH))

