pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*
 * Constants & macros for individual XBAR_SEL10 bitfields
 */

/*!
 * @name Register XBAR_SEL10, field SEL20[4:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT20 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL10_SEL20 field. */
#define XBAR_RD_SEL10_SEL20(base) ((XBAR_SEL10_REG(base) & XBAR_SEL10_SEL20_MASK) >> XBAR_SEL10_SEL20_SHIFT)
#define XBAR_BRD_SEL10_SEL20(base) (BME_UBFX16(&XBAR_SEL10_REG(base), XBAR_SEL10_SEL20_SHIFT, XBAR_SEL10_SEL20_WIDTH))

/*! @brief Set the SEL20 field to a new value. */
#define XBAR_WR_SEL10_SEL20(base, value) (XBAR_RMW_SEL10(base, XBAR_SEL10_SEL20_MASK, XBAR_SEL10_SEL20(value)))
#define XBAR_BWR_SEL10_SEL20(base, value) (BME_BFI16(&XBAR_SEL10_REG(base), ((uint16_t)(value) << XBAR_SEL10_SEL20_SHIFT), XBAR_SEL10_SEL20_SHIFT, XBAR_SEL10_SEL20_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL10, field SEL21[12:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT21 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL10_SEL21 field. */
#define XBAR_RD_SEL10_SEL21(base) ((XBAR_SEL10_REG(base) & XBAR_SEL10_SEL21_MASK) >> XBAR_SEL10_SEL21_SHIFT)
#define XBAR_BRD_SEL10_SEL21(base) (BME_UBFX16(&XBAR_SEL10_REG(base), XBAR_SEL10_SEL21_SHIFT, XBAR_SEL10_SEL21_WIDTH))

/*! @brief Set the SEL21 field to a new value. */
#define XBAR_WR_SEL10_SEL21(base, value) (XBAR_RMW_SEL10(base, XBAR_SEL10_SEL21_MASK, XBAR_SEL10_SEL21(value)))
#define XBAR_BWR_SEL10_SEL21(base, value) (BME_BFI16(&XBAR_SEL10_REG(base), ((uint16_t)(value) << XBAR_SEL10_SEL21_SHIFT), XBAR_SEL10_SEL21_SHIFT, XBAR_SEL10_SEL21_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL11 - Crossbar Select Register 11
 ******************************************************************************/

/*!
 * @brief XBAR_SEL11 - Crossbar Select Register 11 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL11 register
 */
/*@{*/
#define XBAR_RD_SEL11(base)      (XBAR_SEL11_REG(base))
#define XBAR_WR_SEL11(base, value) (XBAR_SEL11_REG(base) = (value))
#define XBAR_RMW_SEL11(base, mask, value) (XBAR_WR_SEL11(base, (XBAR_RD_SEL11(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL11(base, value) (BME_OR16(&XBAR_SEL11_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL11(base, value) (BME_AND16(&XBAR_SEL11_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL11(base, value) (BME_XOR16(&XBAR_SEL11_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL11 bitfields
 */

/*!
 * @name Register XBAR_SEL11, field SEL22[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT22 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL11_SEL22 field. */
#define XBAR_RD_SEL11_SEL22(base) ((XBAR_SEL11_REG(base) & XBAR_SEL11_SEL22_MASK) >> XBAR_SEL11_SEL22_SHIFT)
#define XBAR_BRD_SEL11_SEL22(base) (BME_UBFX16(&XBAR_SEL11_REG(base), XBAR_SEL11_SEL22_SHIFT, XBAR_SEL11_SEL22_WIDTH))

/*! @brief Set the SEL22 field to a new value. */
#define XBAR_WR_SEL11_SEL22(base, value) (XBAR_RMW_SEL11(base, XBAR_SEL11_SEL22_MASK, XBAR_SEL11_SEL22(value)))
#define XBAR_BWR_SEL11_SEL22(base, value) (BME_BFI16(&XBAR_SEL11_REG(base), ((uint16_t)(value) << XBAR_SEL11_SEL22_SHIFT), XBAR_SEL11_SEL22_SHIFT, XBAR_SEL11_SEL22_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL11, field SEL23[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT23 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL11_SEL23 field. */
#define XBAR_RD_SEL11_SEL23(base) ((XBAR_SEL11_REG(base) & XBAR_SEL11_SEL23_MASK) >> XBAR_SEL11_SEL23_SHIFT)
#define XBAR_BRD_SEL11_SEL23(base) (BME_UBFX16(&XBAR_SEL11_REG(base), XBAR_SEL11_SEL23_SHIFT, XBAR_SEL11_SEL23_WIDTH))

/*! @brief Set the SEL23 field to a new value. */
#define XBAR_WR_SEL11_SEL23(base, value) (XBAR_RMW_SEL11(base, XBAR_SEL11_SEL23_MASK, XBAR_SEL11_SEL23(value)))
#define XBAR_BWR_SEL11_SEL23(base, value) (BME_BFI16(&XBAR_SEL11_REG(base), ((uint16_t)(value) << XBAR_SEL11_SEL23_SHIFT), XBAR_SEL11_SEL23_SHIFT, XBAR_SEL11_SEL23_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL12 - Crossbar Select Register 12
 ******************************************************************************/

/*!
 * @brief XBAR_SEL12 - Crossbar Select Register 12 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL12 register
 */
/*@{*/
#define XBAR_RD_SEL12(base)      (XBAR_SEL12_REG(base))
#define XBAR_WR_SEL12(base, value) (XBAR_SEL12_REG(base) = (value))
#define XBAR_RMW_SEL12(base, mask, value) (XBAR_WR_SEL12(base, (XBAR_RD_SEL12(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL12(base, value) (BME_OR16(&XBAR_SEL12_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL12(base, value) (BME_AND16(&XBAR_SEL12_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL12(base, value) (BME_XOR16(&XBAR_SEL12_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL12 bitfields
 */

/*!
 * @name Register XBAR_SEL12, field SEL24[4:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT24 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL12_SEL24 field. */
#define XBAR_RD_SEL12_SEL24(base) ((XBAR_SEL12_REG(base) & XBAR_SEL12_SEL24_MASK) >> XBAR_SEL12_SEL24_SHIFT)
#define XBAR_BRD_SEL12_SEL24(base) (BME_UBFX16(&XBAR_SEL12_REG(base), XBAR_SEL12_SEL24_SHIFT, XBAR_SEL12_SEL24_WIDTH))

/*! @brief Set the SEL24 field to a new value. */
#define XBAR_WR_SEL12_SEL24(base, value) (XBAR_RMW_SEL12(base, XBAR_SEL12_SEL24_MASK, XBAR_SEL12_SEL24(value)))
#define XBAR_BWR_SEL12_SEL24(base, value) (BME_BFI16(&XBAR_SEL12_REG(base), ((uint16_t)(value) << XBAR_SEL12_SEL24_SHIFT), XBAR_SEL12_SEL24_SHIFT, XBAR_SEL12_SEL24_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL12, field SEL25[12:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT25 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL12_SEL25 field. */
#define XBAR_RD_SEL12_SEL25(base) ((XBAR_SEL12_REG(base) & XBAR_SEL12_SEL25_MASK) >> XBAR_SEL12_SEL25_SHIFT)
#define XBAR_BRD_SEL12_SEL25(base) (BME_UBFX16(&XBAR_SEL12_REG(base), XBAR_SEL12_SEL25_SHIFT, XBAR_SEL12_SEL25_WIDTH))

/*! @brief Set the SEL25 field to a new value. */
#define XBAR_WR_SEL12_SEL25(base, value) (XBAR_RMW_SEL12(base, XBAR_SEL12_SEL25_MASK, XBAR_SEL12_SEL25(value)))
#define XBAR_BWR_SEL12_SEL25(base, value) (BME_BFI16(&XBAR_SEL12_REG(base), ((uint16_t)(value) << XBAR_SEL12_SEL25_SHIFT), XBAR_SEL12_SEL25_SHIFT, XBAR_SEL12_SEL25_WIDTH))
/*@}*/

