pyocd/FlashAlgo/source/freescale/devices/MKM34ZA5/MKM34ZA5_extension.h
/*
 * Constants & macros for individual XBAR_SEL15 bitfields
 */

/*!
 * @name Register XBAR_SEL15, field SEL30[4:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT30 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL15_SEL30 field. */
#define XBAR_RD_SEL15_SEL30(base) ((XBAR_SEL15_REG(base) & XBAR_SEL15_SEL30_MASK) >> XBAR_SEL15_SEL30_SHIFT)
#define XBAR_BRD_SEL15_SEL30(base) (BME_UBFX16(&XBAR_SEL15_REG(base), XBAR_SEL15_SEL30_SHIFT, XBAR_SEL15_SEL30_WIDTH))

/*! @brief Set the SEL30 field to a new value. */
#define XBAR_WR_SEL15_SEL30(base, value) (XBAR_RMW_SEL15(base, XBAR_SEL15_SEL30_MASK, XBAR_SEL15_SEL30(value)))
#define XBAR_BWR_SEL15_SEL30(base, value) (BME_BFI16(&XBAR_SEL15_REG(base), ((uint16_t)(value) << XBAR_SEL15_SEL30_SHIFT), XBAR_SEL15_SEL30_SHIFT, XBAR_SEL15_SEL30_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL15, field SEL31[12:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT31 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL15_SEL31 field. */
#define XBAR_RD_SEL15_SEL31(base) ((XBAR_SEL15_REG(base) & XBAR_SEL15_SEL31_MASK) >> XBAR_SEL15_SEL31_SHIFT)
#define XBAR_BRD_SEL15_SEL31(base) (BME_UBFX16(&XBAR_SEL15_REG(base), XBAR_SEL15_SEL31_SHIFT, XBAR_SEL15_SEL31_WIDTH))

/*! @brief Set the SEL31 field to a new value. */
#define XBAR_WR_SEL15_SEL31(base, value) (XBAR_RMW_SEL15(base, XBAR_SEL15_SEL31_MASK, XBAR_SEL15_SEL31(value)))
#define XBAR_BWR_SEL15_SEL31(base, value) (BME_BFI16(&XBAR_SEL15_REG(base), ((uint16_t)(value) << XBAR_SEL15_SEL31_SHIFT), XBAR_SEL15_SEL31_SHIFT, XBAR_SEL15_SEL31_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL16 - Crossbar Select Register 16
 ******************************************************************************/

/*!
 * @brief XBAR_SEL16 - Crossbar Select Register 16 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL16 register
 */
/*@{*/
#define XBAR_RD_SEL16(base)      (XBAR_SEL16_REG(base))
#define XBAR_WR_SEL16(base, value) (XBAR_SEL16_REG(base) = (value))
#define XBAR_RMW_SEL16(base, mask, value) (XBAR_WR_SEL16(base, (XBAR_RD_SEL16(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL16(base, value) (BME_OR16(&XBAR_SEL16_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL16(base, value) (BME_AND16(&XBAR_SEL16_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL16(base, value) (BME_XOR16(&XBAR_SEL16_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL16 bitfields
 */

/*!
 * @name Register XBAR_SEL16, field SEL32[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT32 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL16_SEL32 field. */
#define XBAR_RD_SEL16_SEL32(base) ((XBAR_SEL16_REG(base) & XBAR_SEL16_SEL32_MASK) >> XBAR_SEL16_SEL32_SHIFT)
#define XBAR_BRD_SEL16_SEL32(base) (BME_UBFX16(&XBAR_SEL16_REG(base), XBAR_SEL16_SEL32_SHIFT, XBAR_SEL16_SEL32_WIDTH))

/*! @brief Set the SEL32 field to a new value. */
#define XBAR_WR_SEL16_SEL32(base, value) (XBAR_RMW_SEL16(base, XBAR_SEL16_SEL32_MASK, XBAR_SEL16_SEL32(value)))
#define XBAR_BWR_SEL16_SEL32(base, value) (BME_BFI16(&XBAR_SEL16_REG(base), ((uint16_t)(value) << XBAR_SEL16_SEL32_SHIFT), XBAR_SEL16_SEL32_SHIFT, XBAR_SEL16_SEL32_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_CTRL0 - Crossbar Control Register 0
 ******************************************************************************/

/*!
 * @brief XBAR_CTRL0 - Crossbar Control Register 0 (RW)
 *
 * Reset value: 0x0000U
 *
 * Use this register to configure edge detection, interrupt, and DMA features
 * for the XBAR_OUT0 output.
 */
/*!
 * @name Constants and macros for entire XBAR_CTRL0 register
 */
/*@{*/
#define XBAR_RD_CTRL0(base)      (XBAR_CTRL0_REG(base))
#define XBAR_WR_CTRL0(base, value) (XBAR_CTRL0_REG(base) = (value))
#define XBAR_RMW_CTRL0(base, mask, value) (XBAR_WR_CTRL0(base, (XBAR_RD_CTRL0(base) & ~(mask)) | (value)))
#define XBAR_SET_CTRL0(base, value) (BME_OR16(&XBAR_CTRL0_REG(base), (uint16_t)(value)))
#define XBAR_CLR_CTRL0(base, value) (BME_AND16(&XBAR_CTRL0_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_CTRL0(base, value) (BME_XOR16(&XBAR_CTRL0_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_CTRL0 bitfields
 */

/*!
 * @name Register XBAR_CTRL0, field DEN0[0] (RW)
 *
 * This bit enables the DMA function on the corresponding XBAR_OUT0 output. When
 * enabled, DMA_REQ0 presents the value STS0. When disabled, the DMA_REQ0 output
 * remains low. IEN0 and DEN0 should not both be set to 1.
 *
 * Values:
 * - 0 - DMA disabled
 * - 1 - DMA enabled
 */
/*@{*/
/*! @brief Read current value of the XBAR_CTRL0_DEN0 field. */
#define XBAR_RD_CTRL0_DEN0(base) ((XBAR_CTRL0_REG(base) & XBAR_CTRL0_DEN0_MASK) >> XBAR_CTRL0_DEN0_SHIFT)
#define XBAR_BRD_CTRL0_DEN0(base) (BME_UBFX16(&XBAR_CTRL0_REG(base), XBAR_CTRL0_DEN0_SHIFT, XBAR_CTRL0_DEN0_WIDTH))

/*! @brief Set the DEN0 field to a new value. */
#define XBAR_WR_CTRL0_DEN0(base, value) (XBAR_RMW_CTRL0(base, (XBAR_CTRL0_DEN0_MASK | XBAR_CTRL0_STS0_MASK), XBAR_CTRL0_DEN0(value)))
#define XBAR_BWR_CTRL0_DEN0(base, value) (BME_BFI16(&XBAR_CTRL0_REG(base), ((uint16_t)(value) << XBAR_CTRL0_DEN0_SHIFT), XBAR_CTRL0_DEN0_SHIFT, XBAR_CTRL0_DEN0_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_CTRL0, field IEN0[1] (RW)
 *
 * This bit enables the interrupt function on the corresponding XBAR_OUT0
 * output. When the interrupt is enabled, the output INT_REQ0 reflects the value STS0.
 * When the interrupt is disabled, INT_REQ0 remains low. The interrupt request is
 * cleared by writing a 1 to STS0. IEN0 and DEN0 should not both be set to 1.
 *
 * Values:
 * - 0 - Interrupt disabled
 * - 1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the XBAR_CTRL0_IEN0 field. */
#define XBAR_RD_CTRL0_IEN0(base) ((XBAR_CTRL0_REG(base) & XBAR_CTRL0_IEN0_MASK) >> XBAR_CTRL0_IEN0_SHIFT)
#define XBAR_BRD_CTRL0_IEN0(base) (BME_UBFX16(&XBAR_CTRL0_REG(base), XBAR_CTRL0_IEN0_SHIFT, XBAR_CTRL0_IEN0_WIDTH))

/*! @brief Set the IEN0 field to a new value. */
#define XBAR_WR_CTRL0_IEN0(base, value) (XBAR_RMW_CTRL0(base, (XBAR_CTRL0_IEN0_MASK | XBAR_CTRL0_STS0_MASK), XBAR_CTRL0_IEN0(value)))
#define XBAR_BWR_CTRL0_IEN0(base, value) (BME_BFI16(&XBAR_CTRL0_REG(base), ((uint16_t)(value) << XBAR_CTRL0_IEN0_SHIFT), XBAR_CTRL0_IEN0_SHIFT, XBAR_CTRL0_IEN0_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_CTRL0, field EDGE0[3:2] (RW)
 *
 * This field selects which edges on XBAR_OUT0 cause STS0 to assert.
 *
 * Values:
 * - 00 - STS0 never asserts
 * - 01 - STS0 asserts on rising edges of XBAR_OUT0
 * - 10 - STS0 asserts on falling edges of XBAR_OUT0
 * - 11 - STS0 asserts on rising and falling edges of XBAR_OUT0
 */
/*@{*/
/*! @brief Read current value of the XBAR_CTRL0_EDGE0 field. */
#define XBAR_RD_CTRL0_EDGE0(base) ((XBAR_CTRL0_REG(base) & XBAR_CTRL0_EDGE0_MASK) >> XBAR_CTRL0_EDGE0_SHIFT)
#define XBAR_BRD_CTRL0_EDGE0(base) (BME_UBFX16(&XBAR_CTRL0_REG(base), XBAR_CTRL0_EDGE0_SHIFT, XBAR_CTRL0_EDGE0_WIDTH))

/*! @brief Set the EDGE0 field to a new value. */
#define XBAR_WR_CTRL0_EDGE0(base, value) (XBAR_RMW_CTRL0(base, (XBAR_CTRL0_EDGE0_MASK | XBAR_CTRL0_STS0_MASK), XBAR_CTRL0_EDGE0(value)))
#define XBAR_BWR_CTRL0_EDGE0(base, value) (BME_BFI16(&XBAR_CTRL0_REG(base), ((uint16_t)(value) << XBAR_CTRL0_EDGE0_SHIFT), XBAR_CTRL0_EDGE0_SHIFT, XBAR_CTRL0_EDGE0_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_CTRL0, field STS0[4] (W1C)
 *
 * This bit reflects the results of edge detection for XBAR_OUT0. This field is
 * set to 1 when an edge consistent with the current setting of EDGE0 is detected
 * on XBAR_OUT0. This field is cleared by writing 1 to it or by a DMA_ACK0
 * reception when DEN0 is set. Writing 0 to the field has no effect. When interrupt or
 * DMA functionality is enabled for XBAR_OUT0, this field is 1 when the
 * interrupt or DMA request is asserted and 0 when the interrupt or DMA request has been
 * cleared.
 *
 * Values:
 * - 0 - Active edge not yet detected on XBAR_OUT0
 * - 1 - Active edge detected on XBAR_OUT0
 */
/*@{*/
/*! @brief Read current value of the XBAR_CTRL0_STS0 field. */
#define XBAR_RD_CTRL0_STS0(base) ((XBAR_CTRL0_REG(base) & XBAR_CTRL0_STS0_MASK) >> XBAR_CTRL0_STS0_SHIFT)
#define XBAR_BRD_CTRL0_STS0(base) (BME_UBFX16(&XBAR_CTRL0_REG(base), XBAR_CTRL0_STS0_SHIFT, XBAR_CTRL0_STS0_WIDTH))

/*! @brief Set the STS0 field to a new value. */
#define XBAR_WR_CTRL0_STS0(base, value) (XBAR_RMW_CTRL0(base, XBAR_CTRL0_STS0_MASK, XBAR_CTRL0_STS0(value)))
#define XBAR_BWR_CTRL0_STS0(base, value) (BME_BFI16(&XBAR_CTRL0_REG(base), ((uint16_t)(value) << XBAR_CTRL0_STS0_SHIFT), XBAR_CTRL0_STS0_SHIFT, XBAR_CTRL0_STS0_WIDTH))
/*@}*/

/* Macros for XBAR_SELx register address.  */
#define XBAR_SELx_ADDR(base, index)               ((uintptr_t)&XBAR_SEL0_REG(base) + ((index) & (~1U)))

